#include <string>
#include <iostream>
#include <fstream>
#include <iosfwd>
#include <iomanip>
#include <unordered_map>
#include <cuchar>
#include <ctime>
#include <vector>
//#include "Duncode.h"

using namespace std;

class Tool{
public :
    vector<int> heads= {0x0000, 0x0080, 0x0100, 0x0180, 0x0250, 0x02B0, 0x0300, 0x0370, 0x0400, 0x0500, 0x0530, 0x0590, 0x0600, 0x0700, 0x0750, 0x0780, 0x07C0, 0x0800, 0x0840, 0x0860, 0x08A0, 0x0900, 0x0980, 0x0A00, 0x0A80, 0x0B00, 0x0B80, 0x0C00, 0x0C80, 0x0D00, 0x0D80, 0x0E00, 0x0E80, 0x0F00, 0x1000, 0x10A0, 0x1100, 0x1200, 0x1380, 0x13A0, 0x1400, 0x1680, 0x16A0, 0x1700, 0x1720, 0x1740, 0x1760, 0x1780, 0x1800, 0x18B0, 0x1900, 0x1950, 0x1980, 0x19E0, 0x1A00, 0x1A20, 0x1AB0, 0x1B00, 0x1B80, 0x1BC0, 0x1C00, 0x1C50, 0x1C80, 0x1C90, 0x1CC0, 0x1CD0, 0x1D00, 0x1D80, 0x1DC0, 0x1E00, 0x1F00, 0x2000, 0x2070, 0x20A0, 0x20D0, 0x2100, 0x2150, 0x2190, 0x2200, 0x2300, 0x2400, 0x2440, 0x2460, 0x2500, 0x2580, 0x25A0, 0x2600, 0x2700, 0x27C0, 0x27F0, 0x2800, 0x2900, 0x2980, 0x2A00, 0x2B00, 0x2C00, 0x2C60, 0x2C80, 0x2D00, 0x2D30, 0x2D80, 0x2DE0, 0x2E00, 0x2E80, 0x2F00, 0x2FF0, 0x3000, 0x3040, 0x30A0, 0x3100, 0x3130, 0x3190, 0x31A0, 0x31C0, 0x31F0, 0x3200, 0x3300, 0x3400, 0x4DC0, 0x4E00, 0xA000, 0xA490, 0xA4D0, 0xA500, 0xA640, 0xA6A0, 0xA700, 0xA720, 0xA800, 0xA830, 0xA840, 0xA880, 0xA8E0, 0xA900, 0xA930, 0xA960, 0xA980, 0xA9E0, 0xAA00, 0xAA60, 0xAA80, 0xAAE0, 0xAB00, 0xAB30, 0xAB70, 0xABC0, 0xAC00, 0xD7B0, 0xD800, 0xDB80, 0xDC00, 0xE000, 0xF900, 0xFB00, 0xFB50, 0xFE00, 0xFE10, 0xFE20, 0xFE30, 0xFE50, 0xFE70, 0xFF00, 0xFFF0, 0x10000, 0x10080, 0x10100, 0x10140, 0x10190, 0x101D0, 0x10280, 0x102A0, 0x102E0, 0x10300, 0x10330, 0x10350, 0x10380, 0x103A0, 0x10400, 0x10450, 0x10480, 0x104B0, 0x10500, 0x10530, 0x10600, 0x10800, 0x10840, 0x10860, 0x10880, 0x108E0, 0x10900, 0x10920, 0x10980, 0x109A0, 0x10A00, 0x10A60, 0x10A80, 0x10AC0, 0x10B00, 0x10B40, 0x10B60, 0x10B80, 0x10C00, 0x10C80, 0x10D00, 0x10E60, 0x10F00, 0x10F30, 0x10FE0, 0x11000, 0x11080, 0x110D0, 0x11100, 0x11150, 0x11180, 0x111E0, 0x11200, 0x11280, 0x112B0, 0x11300, 0x11400, 0x11480, 0x11580, 0x11600, 0x11660, 0x11680, 0x11700, 0x11800, 0x118A0, 0x119A0, 0x11A00, 0x11A50, 0x11AC0, 0x11C00, 0x11C70, 0x11D00, 0x11D60, 0x11EE0, 0x11FC0, 0x12000, 0x12400, 0x12480, 0x13000, 0x13430, 0x14400, 0x16800, 0x16A40, 0x16AD0, 0x16B00, 0x16E40, 0x16F00, 0x16FE0, 0x17000, 0x18800, 0x1B000, 0x1B100, 0x1B130, 0x1B170, 0x1BC00, 0x1BCA0, 0x1D000, 0x1D100, 0x1D200, 0x1D2E0, 0x1D300, 0x1D360, 0x1D400, 0x1D800, 0x1E000, 0x1E100, 0x1E2C0, 0x1E800, 0x1E900, 0x1EC70, 0x1ED00, 0x1EE00, 0x1F000, 0x1F030, 0x1F0A0, 0x1F100, 0x1F200, 0x1F300, 0x1F600, 0x1F650, 0x1F680, 0x1F700, 0x1F780, 0x1F800, 0x1F900, 0x1FA00, 0x1FA70, 0x20000, 0x2A700, 0x2B740, 0x2B820, 0x2CEB0, 0x2F800, 0xE0000, 0xE0100, 0xF0000, 0x100000, 0x80}; //要合理，不然错误发现不了
    vector<int> tails = {0x007F, 0x00FF, 0x017F, 0x024F, 0x02AF, 0x02FF, 0x036F, 0x03FF, 0x04FF, 0x052F, 0x058F, 0x05FF, 0x06FF, 0x074F, 0x077F, 0x07BF, 0x07FF, 0x083F, 0x085F, 0x086F, 0x08FF, 0x097F, 0x09FF, 0x0A7F, 0x0AFF, 0x0B7F, 0x0BFF, 0x0C7F, 0x0CFF, 0x0D7F, 0x0DFF, 0x0E7F, 0x0EFF, 0x0FFF, 0x109F, 0x10FF, 0x11FF, 0x137F, 0x139F, 0x13FF, 0x167F, 0x169F, 0x16FF, 0x171F, 0x173F, 0x175F, 0x177F, 0x17FF, 0x18AF, 0x18FF, 0x194F, 0x197F, 0x19DF, 0x19FF, 0x1A1F, 0x1AAF, 0x1AFF, 0x1B7F, 0x1BBF, 0x1BFF, 0x1C4F, 0x1C7F, 0x1C8F, 0x1CBF, 0x1CCF, 0x1CFF, 0x1D7F, 0x1DBF, 0x1DFF, 0x1EFF, 0x1FFF, 0x206F, 0x209F, 0x20CF, 0x20FF, 0x214F, 0x218F, 0x21FF, 0x22FF, 0x23FF, 0x243F, 0x245F, 0x24FF, 0x257F, 0x259F, 0x25FF, 0x26FF, 0x27BF, 0x27EF, 0x27FF, 0x28FF, 0x297F, 0x29FF, 0x2AFF, 0x2BFF, 0x2C5F, 0x2C7F, 0x2CFF, 0x2D2F, 0x2D7F, 0x2DDF, 0x2DFF, 0x2E7F, 0x2EFF, 0x2FDF, 0x2FFF, 0x303F, 0x309F, 0x30FF, 0x312F, 0x318F, 0x319F, 0x31BF, 0x31EF, 0x31FF, 0x32FF, 0x33FF, 0x4DBF, 0x4DFF, 0x9FFF, 0xA48F, 0xA4CF, 0xA4FF, 0xA63F, 0xA69F, 0xA6FF, 0xA71F, 0xA7FF, 0xA82F, 0xA83F, 0xA87F, 0xA8DF, 0xA8FF, 0xA92F, 0xA95F, 0xA97F, 0xA9DF, 0xA9FF, 0xAA5F, 0xAA7F, 0xAADF, 0xAAFF, 0xAB2F, 0xAB6F, 0xABBF, 0xABFF, 0xD7AF, 0xD7FF, 0xDB7F, 0xDBFF, 0xDFFF, 0xF8FF, 0xFAFF, 0xFB4F, 0xFDFF, 0xFE0F, 0xFE1F, 0xFE2F, 0xFE4F, 0xFE6F, 0xFEFF, 0xFFEF, 0xFFFF, 0x1007F, 0x100FF, 0x1013F, 0x1018F, 0x101CF, 0x101FF, 0x1029F, 0x102DF, 0x102FF, 0x1032F, 0x1034F, 0x1037F, 0x1039F, 0x103DF, 0x1044F, 0x1047F, 0x104AF, 0x104FF, 0x1052F, 0x1056F, 0x1077F, 0x1083F, 0x1085F, 0x1087F, 0x108AF, 0x108FF, 0x1091F, 0x1093F, 0x1099F, 0x109FF, 0x10A5F, 0x10A7F, 0x10A9F, 0x10AFF, 0x10B3F, 0x10B5F, 0x10B7F, 0x10BAF, 0x10C4F, 0x10CFF, 0x10D3F, 0x10E7F, 0x10F2F, 0x10F6F, 0x10FFF, 0x1107F, 0x110CF, 0x110FF, 0x1114F, 0x1117F, 0x111DF, 0x111FF, 0x1124F, 0x112AF, 0x112FF, 0x1137F, 0x1147F, 0x114DF, 0x115FF, 0x1165F, 0x1167F, 0x116CF, 0x1173F, 0x1184F, 0x118FF, 0x119FF, 0x11A4F, 0x11AAF, 0x11AFF, 0x11C6F, 0x11CBF, 0x11D5F, 0x11DAF, 0x11EFF, 0x11FFF, 0x123FF, 0x1247F, 0x1254F, 0x1342F, 0x1343F, 0x1467F, 0x16A3F, 0x16A6F, 0x16AFF, 0x16B8F, 0x16E9F, 0x16F9F, 0x16FFF, 0x187FF, 0x18AFF, 0x1B0FF, 0x1B12F, 0x1B16F, 0x1B2FF, 0x1BC9F, 0x1BCAF, 0x1D0FF, 0x1D1FF, 0x1D24F, 0x1D2FF, 0x1D35F, 0x1D37F, 0x1D7FF, 0x1DAAF, 0x1E02F, 0x1E14F, 0x1E2FF, 0x1E8DF, 0x1E95F, 0x1ECBF, 0x1ED4F, 0x1EEFF, 0x1F02F, 0x1F09F, 0x1F0FF, 0x1F1FF, 0x1F2FF, 0x1F5FF, 0x1F64F, 0x1F67F, 0x1F6FF, 0x1F77F, 0x1F7FF, 0x1F8FF, 0x1F9FF, 0x1FA6F, 0x1FAFF, 0x2A6DF, 0x2B73F, 0x2B81F, 0x2CEAF, 0x2EBEF, 0x2FA1F, 0xE007F, 0xE01EF, 0xFFFFF, 0x10FFFF, 0xffffff};

    vector<int> alphabetSize = {128, 128, 128, 208, 96, 80, 112, 144, 256, 48, 96, 112, 256, 80, 48, 64, 64, 64, 32, 16, 96, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 256, 160, 96, 256, 384, 32, 96, 640, 32, 96, 32, 32, 32, 32, 128, 176, 80, 80, 48, 96, 32, 32, 144, 80, 128, 64, 64, 80, 48, 16, 48, 16, 48, 128, 64, 64, 256, 256, 112, 48, 48, 48, 80, 64, 112, 256, 256, 64, 32, 160, 128, 32, 96, 256, 192, 48, 16, 256, 128, 128, 256, 256, 96, 32, 128, 48, 80, 96, 32, 128, 128, 224, 16, 64, 96, 96, 48, 96, 16, 32, 48, 16, 256, 256, 6592, 64, 20992, 1168, 64, 48, 320, 96, 96, 32, 224, 48, 16, 64, 96, 32, 48, 48, 32, 96, 32, 96, 32, 96, 32, 48, 64, 80, 64, 11184, 80, 896, 128, 1024, 6400, 512, 80, 688, 16, 16, 16, 32, 32, 144, 240, 16, 128, 128, 64, 80, 64, 48, 32, 64, 32, 48, 32, 48, 32, 64, 80, 48, 48, 80, 48, 64, 384, 64, 32, 32, 48, 32, 32, 32, 32, 96, 96, 32, 32, 64, 64, 32, 32, 48, 80, 128, 64, 32, 48, 64, 32, 128, 80, 48, 80, 48, 96, 32, 80, 48, 80, 128, 128, 96, 128, 96, 32, 80, 64, 80, 96, 96, 80, 96, 64, 112, 80, 96, 80, 64, 1024, 128, 208, 1072, 16, 640, 576, 48, 48, 144, 96, 160, 32, 6144, 768, 256, 48, 64, 400, 160, 16, 256, 256, 80, 32, 96, 32, 1024, 688, 48, 80, 64, 224, 96, 80, 80, 256, 48, 112, 96, 256, 256, 768, 80, 48, 128, 128, 128, 256, 256, 112, 144, 42720, 4160, 224, 5776, 7488, 544, 128, 240, 65536, 65536};
//    vector<string> cnNnames = {"基本拉丁字母", "拉丁字母补充-1", "拉丁字母扩展-A", "拉丁字母扩展-B", "国际音标扩展", "占位修饰符号", "结合附加符号", "希腊字母及科普特字母", "西里尔字母", "西里尔字母补充", "亚美尼亚字母", "希伯来文字母", "阿拉伯文字母", "叙利亚字母", "阿拉伯文补充", "它拿字母", "西非书面文字", "撒玛利亚字母", "曼达文字", "叙利亚文补充", "阿拉伯文扩展-A", "天城文", "孟加拉文", "古木基文", "古吉拉特文", "奥里亚文", "泰米尔文", "泰卢固文", "卡纳达文", "马拉雅拉姆文", "僧伽罗文", "泰文", "寮文", "藏文", "缅甸文", "乔治亚字母", "谚文字母", "吉兹字母", "吉兹字母补充", "切罗基字母", "统一加拿大原住民音节文字", "欧甘字母", "卢恩字母", "他加禄字母", "哈努诺文", "布希德文", "塔格巴努亚文", "高棉文", "蒙古文", "加拿大原住民音节文字扩展", "林布文", "德宏傣文", "新傣仂文", "高棉文符号", "布吉文", "老傣文", "组合变音标记扩展", "巴厘字母", "巽他字母", "巴塔克文", "绒巴文", "桑塔利文", "西里尔字母扩展-C", "乔治亚字母扩展", "巽他字母补充", "梵文吠陀扩展", "音标扩展", "音标扩展补充", "结合附加符号补充", "拉丁文扩展附加", "希腊字母扩展", "常用标点", "上标及下标", "货币符号", "组合用记号", "字母式符号", "数字形式", "箭头", "数学运算子", "杂项工业符号", "控制图片", "光学识别符", "带圈字母和数字", "制表符", "方块元素", "几何图形", "杂项符号", "装饰符号", "杂项数学符号-A", "追加箭头-A", "盲文点字模型", "追加箭头-B", "杂项数学符号-B", "追加数学运算子", "杂项符号和箭头", "格拉哥里字母", "拉丁文扩展-C", "科普特字母", "乔治亚字母补充", "提非纳文", "吉兹字母扩展", "西里尔字母扩展-A", "追加标点", "中日韩汉字部首补充", "康熙部首", "表意文字描述字符", "中日韩符号和标点", "平假名", "片假名", "注音符号", "谚文相容字母", "汉文训读", "注音符号扩展", "中日韩笔画", "片假名拼音扩展", "带圈的CJK字元及月份", "中日韩相容字元", "中日韩统一表意文字扩展区A", "易经六十四卦符号", "中日韩统一表意文字", "彝文音节", "彝文字根", "老傈僳文", "瓦伊语文字", "西里尔字母扩展-B", "巴姆穆文字", "修饰用声调符号", "拉丁文扩展-D", "锡尔赫特文", "通用印度数字格式", "八思巴字", "索拉什特拉文", "天城文扩展", "克耶里字母", "勒姜字母", "谚文扩展-A", "爪哇字母", "缅甸文扩展-B", "占语字母", "缅甸文扩展-A", "", "越南傣文", "曼尼普尔文扩展功能", "吉兹字母扩展功能-A", "拉丁文扩展功能-E", "切罗基语补充", "曼尼普尔文", "谚文音节", "谚文字母扩展-B", "高半代用区", "高半私人代用区", "低半代用区", "私用区", "中日韩相容表意文字", "字母表达形式", "阿拉伯字母表达形式-A", "异体字选择符", "竖排形式", "组合用半符号", "中日韩相容形式", "小写变体形式", "阿拉伯文表达形式-B", "半形及全形字元", "特殊", "线形文字B音节文字", "线形文字B表意文字", "爱琴海数字", "古希腊数字", "古代记数系统", "斐斯托斯圆盘", "吕基亚字母", "卡里亚字母", "科普特闰余数字", "古意大利字母", "哥特字母", "古彼尔姆文", "乌加里特字母", "古波斯楔形文字", "德瑟雷特字母", "萧伯纳字母", "奥斯曼亚字母", "欧塞奇字母", "艾尔巴桑字母", "高加索阿尔巴尼亚文", "线形文字A", "塞浦路斯音节文字", "帝国亚拉姆文字", "帕尔迈拉字母", "纳巴泰字母", "哈特拉文", "腓尼基字母", "吕底亚字母", "麦罗埃文圣书体", "麦罗埃文草书体", "佉卢文", "古南阿拉伯字母", "古北阿拉伯字母", "摩尼字母", "阿维斯陀字母", "碑刻帕提亚文", "碑刻巴列维文", "诗篇巴列维文", "古突厥文", "古匈牙利字母", "哈乃斐罗兴亚文字", "卢米文数字", "古粟特字母", "粟特字母", "以利买字母", "婆罗米文字", "凯提文", "索拉僧平文字", "查克马文", "马哈佳尼文", "夏拉达文", "古僧伽罗文数字", "可吉文", "穆尔塔尼文", "库达瓦迪文", "古兰塔文", "纽瓦字母", "提尔胡塔文", "悉昙文字", "莫迪文", "蒙古文补充", "塔克里字母", "阿洪姆文", "多格拉文", "瓦兰齐地文", "南迪城文", "札那巴札尔方形字母", "索永布文字", "包钦豪文", "拜克舒基文", "玛钦文", "马萨拉姆贡德文字", "贡贾拉贡德文字", "望加锡文", "泰米尔文补充", "楔形文字", "楔形文字数字和标点符号", "早期王朝楔形文字", "埃及圣书体", "埃及圣书体格式控制", "安纳托利亚象形文字", "巴姆穆文字补充", "默禄文", "巴萨哇文字", "帕哈苗文", "梅德法伊德林文", "柏格理苗文", "表意符号和标点符号", "西夏文", "西夏文部首", "日文假名补充", "日文假名扩展-A", "小型日文假名扩展", "女书", "杜普雷速记", "速记格式控制符", "拜占庭音乐符号", "音乐符号", "古希腊音乐记号", "玛雅数字", "太玄经符号", "算筹", "字母和数字符号", "萨顿书写符号", "格拉哥里字母补充", "创世纪苗文", "文乔字母", "门德基卡库文", "阿德拉姆字母", "印度西亚格数字", "奥斯曼西亚格数字", "阿拉伯字母数字符号", "麻将牌", "多米诺骨牌", "扑克牌", "带圈字母数字补充", "带圈表意文字补充", "杂项符号和象形文字", "表情符号", "装饰符号", "交通和地图符号", "炼金术符号", "几何图形扩展", "追加箭头-C", "补充符号和象形文字", "棋类符号", "符号和象形文字扩展-A", "中日韩统一表意文字扩展区B", "中日韩统一表意文字扩展区C", "中日韩统一表意文字扩展区D", "中日韩统一表意文字扩展区E", "中日韩统一表意文字扩展区F", "中日韩相容表意文字补充区", "标签", "选择器变化补充", "补充私人使用区-A", "补充私人使用区-B", "陌生字"};
//    vector<string> enNames = {"Basic Latin[g]", " Latin-1 Supplement[h]", " Latin Extended-A", " Latin Extended-B", " IPA Extensions", " Spacing Modifier Letters", " Combining Diacritical Marks", " Greek and Coptic", " Cyrillic", " Cyrillic Supplement", " Armenian", " Hebrew", " Arabic", " Syriac", " Arabic Supplement", " Thaana", " NKo", " Samaritan", " Mandaic", " Syriac Supplement", " Arabic Extended-A", " Devanagari", " Bengali", " Gurmukhi", " Gujarati", " Oriya", " Tamil", " Telugu", " Kannada", " Malayalam", " Sinhala", " Thai", " Lao", " Tibetan", " Myanmar", " Georgian", " Hangul Jamo", " Ethiopic", " Ethiopic Supplement", " Cherokee", " Unified Canadian Aboriginal Syllabics", " Ogham", " Runic", " Tagalog", " Hanunoo", " Buhid", " Tagbanwa", " Khmer", " Mongolian", " Unified Canadian Aboriginal Syllabics Extended", " Limbu", " Tai Le", " New Tai Le", " Khmer Symbols", " Buginese", " Tai Tham", " Combining Diacritical Marks Extended", " Balinese", " Sundanese", " Batak", " Lepcha", " Ol Chiki", " Cyrillic Extended-C", " Georgian Extended", " Sundanese Supplement", " Vedic Extensions", " Phonetic Extensions", " Phonetic Extensions Supplement", " Combining Diacritical Marks Supplement", " Latin Extended Additional", " Greek Extended", " General Punctuation", " Superscripts and Subscripts", " Currency Symbols", " Combining Diacritical Marks for Symbols", " Letterlike Symbols", " Number Forms", " Arrows", " Mathematical Operators", " Miscellaneous Technical", " Control Pictures", " Optical Character Recognition", " Enclosed Alphanumerics", " Box Drawing", " Block Elements", " Geometric Shapes", " Miscellaneous Symbols", " Dingbats", " Miscellaneous Mathematical Symbols-A", " Supplemental Arrows-A", " Braille Patterns", " Supplemental Arrows-B", " Miscellaneous Mathematical Symbols-B", " Supplemental Mathematical Operators", " Miscellaneous Symbols and Arrows", " Glagolitic", " Latin Extended-C", " Coptic", " Georgian Supplement", " Tifinagh", " Ethiopic Extended", " Cyrillic Extended-A", " Supplemental Punctuation", " CJK Radicals Supplement", " Kangxi Radicals", " Ideographic Description Characters", " CJK Symbols and Punctuation", " Hiragana", " Katakana", " Bopomofo", " Hangul Compatibility Jamo", " Kanbun", " Bopomofo Extended", " CJK Strokes", " Katakana Phonetic Extensions", " Enclosed CJK Letters and Months", " CJK Compatibility", " CJK Unified Ideographs Extension A", " Yijing Hexagram Symbols", " CJK Unified Ideographs", " Yi Syllables", " Yi Radicals", " Lisu", " Vai", " Cyrillic Extended-B", " Bamum", " Modifier Tone Letters", " Latin Extended-D", " Syloti Nagri", " Common Indic Number Forms", " Phags-pa", " Saurashtra", " Devanagari Extended", " Kayah Li", " Rejang", " Hangul Jamo Extended-A", " Javanese", " Myanmar Extended-B", " Cham", " Myanmar Extended-A", " Tai Viet", " Meetei Mayek Extensions", " Ethiopic Extended-A", " Latin Extended-E", " Cherokee Supplemen", " Meetei Mayek", " Hangul Syllables", " Hangul Jamo Extended-B", " High Surrogates", " High Private Use Surrogates", " Low Surrogates", " Private Use Area", " CJK Compatibility Ideographs", " Alphabetic Presentation Forms", " Arabic Presentation Forms-A", " Variation Selectors", " Vertical Forms", " Combining Half Marks", " CJK Compatibility Forms", " Small Form Variants", " Arabic Presentation Forms-B", " Halfwidth and Fullwidth Forms", " Specials", " Linear B Syllabary", " Linear B Ideograms", " Aegean Numbers", " Ancient Greek Numbers", " Ancient Symbols", " Phaistos Disc", " Lycian", " Carian", " Coptic Epact Numbers", " Old Italic", " Gothic", " Old Permic", " Ugaritic", " Old Persian", " Deseret", " Shavian", " Osmanya", " Osage", " Elbasan", " Caucasian Albanian", " Linear A", " Cypriot Syllabary", " Imperial Aramaic", " Palmyrene", " Nabataean", " Hatran", " Phoenician", " Lydian", " Meroitic Hieroglyphs", " Meroitic Cursive", " Kharoshthi", " Old South Arabian", " Old North Arabian", " Manichaean", " Avestan", " Inscriptional Parthian", " Inscriptional Pahlavi", " Psalter Pahlavi", " Old Turkic", " Old Hungarian", " Hanifi Rohingya", " Rumi Numeral Symbols", " Old Sogdian", " Sogdian", " Elymaic", " Brahmi", " Kaithi", " Sora Sompeng", " Chakma", " Mahajani", " Sharada", " Sinhala Archaic Numbers", " Khojki", " Multani", " Khudawadi", " Grantha", " Newa", " Tirhuta", " Siddham", " Modi", " Mongolian Supplement", " Takri", " Ahom", " Dogra", " Warang Citi", " Nandinagari", " Zanabazar Square", " Soyombo", " Pau Cin Hau", " Bhaiksuki", " Marchen", " Masaram Gondi", " Gunjala Gondi", " Makasar", " Tamil Supplement", " Cuneiform", " Cuneiform Numbers and Punctuation", " Early Dynastic Cuneiform", " Egyptian Hieroglyphs", " Egyptian Hieroglyph Format Controls", " Anatolian Hieroglyphs", " Bamum Supplement", " Mro", " Bassa Vah", " Pahawh Hmong", " Medefaidrin", " Miao", " Ideographic Symbols and Punctuation", " Tangut", " Tangut Components", " Kana Supplement", " Kana Extended-A", " Small Kana Extension", " Nushu", " Duployan", " Shorthand Format Controls", " Byzantine Musical Symbols", " Musical Symbols", " Ancient Greek Musical Notation", " Mayan Numerals", " Tai Xuan Jing Symbols", " Counting Rod Numerals", " Mathematical Alphanumeric Symbols", " Sutton SignWriting", " Glagolitic Supplement", " Nyiakeng Puachue Hmong", " Wancho", " Mende Kikakui", " Adlam", " Indic Siyaq Numbers", " Ottoman Siyaq Numbers", " Arabic Mathematical Alphabetic Symbols", " Mahjong Tiles", " Domino Tiles", " Playing Cards", " Enclosed Alphanumeric Supplement", " Enclosed Ideographic Supplement", " Miscellaneous Symbols and Pictographs", " Emoticons", " Ornamental Dingbats", " Transport and Map Symbols", " Alchemical Symbols", " Geometric Shapes Extended", " Supplemental Arrows-C", " Supplemental Symbols and Pictographs", " Chess Symbols", " Symbols and Pictographs Extended-A", " CJK Unified Ideographs Extension B", " CJK Unified Ideographs Extension C", " CJK Unified Ideographs Extension D", " CJK Unified Ideographs Extension E", " CJK Unified Ideographs Extension F", " CJK Compatibility Ideographs Supplement", " Tags", " Variation Selectors Supplement", " Supplementary Private Use Area-A", " Supplementary Private Use Area-B", "OOV"};
    // 0ascii 双字节1[拉丁] 2常用汉字 3三字节[不常用汉字] 4四节三字[希腊文、西里尔、阿拉伯] 5四节双字[alphaCount<=256] 四节单字[6罕见(alphaCount>256)、7新文字、8临时区、9私用区]
    string wikiHan=u8"的。年、一在中是人大有和為以月日了国为地國於成公上不斯行出他部之名主其作生分方于西下用到第》《家而位及由後時民法被本南学市里會同多可子政个特自德任文克北高加利海新「」最與平代前也后等所學三道度美面因個建得此拉物尔山要小教路事时至立会口州入世能二表區理發工合天科区外定球期化台十但使次全通性者共式重布安都並发力士站來爾比基軍王军院省城尼原相明米動格水目金長英司这正系治列對府開巴与制亞這长星電阿四如或元港影員起女对現首東提林常經當演改進来并間心卡量东賽過然向开戰就接始界體动河镇意將車员曾管內亚機委手色程受交保指形場包机夫馬音型流香内已直些集太总史該经線进过隊县稱五身空车校字马品業江朝现古电更社展该示种间種灣兩設业洲持羅各數官将反回著体普命战達選京光活罗取造石信少族曲支局神縣清村蘭波设称近数非約只当解伊聯情属它每又队運研联件角號放即華片武關密總李她統商則版樂福座运計先們两知场白括屬收未無根器赛往組去果歌产华达足线再視塔组初究六统議季且語级派号语居兵从今引打從完域亦关帝威们宗花兰播除團书義島段參计務育雷服广令瓦實洛八門希說很言速约查結土產哈修吉功周街死置博另超存客宣傳推好维類勒率維我處投党單青班源单供实九父湖伯認具獲舉田务母沙求男印案义張書那火故例议航廣百己臺別参攻皇助还落图帶份技均應龍導铁劇致早变增資萬專點整奥容副乡模群堂川登半塞选氏七擊越万級師门说游点处易告失托黑變积食黨领境領深奇風结室团应紀森積苏乐导传排升射限需節頭甲製央奧標連老畫真无木象像姆辖轉何类获施沒纳席据才際盟千魚仍鐵步埃洋報便牙考泰權條哥想恩氣配防感迪決曼論佛低據納师住认术留效律止视警记蒙历術冠底病纪還阳报把索料志消察離康圖景俄愛张风唱降素強移創看息批祖革着獎職承则親控算票遊觀念典授續藏較专負带标思汉許圣友瑞記岛际毛论夏守做陸别精没見園責草拔督裝房望附依題章述办錄照转节资决权歷梅丹質莫永抗蘇堡条陳丁萨編击調富聖莱網停职坦澳蒂退复辦皮左牌唐封气构隆歐戲拿鎮快值船邦極爭陆寺般隨終候營黃給破郡協擔调含朗問突植試似嘉创举興尚准济弗切强必眾旅龙項划剧藝头网注争久延走店鄉离倫岸兒艾樣耶规漢野春随右护飛館帕薩连架协鲁邊衛黄核熱售装弟赫给雄佳编亡規轄油環质判諾占讓短備層诺構輯馆繼什股题端筑卫松宁菲雙圍许问遭策沃戏摩護評伦担环役旗逐样序雅聲项獨观园費若营酒送宋距劃欧晚籍陽亲紅红殺乘寫微暴胡束秀末边农頓范终良干魯響烏杜尾勝準庄桥兴兼织署库敗津略峰庭歲血款备善證奖銀续贝醫采彈濟朱散裡婚甚免见樓拍假喜差热予臣较儿艦狀玉卻復仁雖劉追烈征韓围双黎尺写話背酸爱证廷顯盛屆害板云萊測舞牛爆医谷企址詞录昌沿互習罪媒层众救織載独預刘採评艺宮溪继舰援陈余秘几貝荷介屋画试遠溫透君執映請坡届梁僅叶飞智霍幾態楼响槍冰费声勢敦材穆戶滿佈係翰佩價按郎徒巡童拜杀益確巨戈乌橋仅混玩羽麗皆顿极探夜雲簡禁築禮某眼刺旋途茨壓你庫刻描寶替讀吸殿跟温培岁耳遇符宇爵葉難刊岩聞午撤聚洪麥找魔休漫炮私测确充话竹户肯固奉斗雪毒娜擁返幕唯桑雨逃状監庆坑忠骨斷側银否農訊责佔远優震激验召傷犯廠刑操尤異靠範練露坐捕靈满赤舊显缺徐穿乎細識让飾词輕況申輪翻遗兄姓柏态妻須载驗陵负待迫攝抵陣孔浙吳湾鬥辛惠換秋廳习泉傑努韩默呼胞絕餘压孩汽侵芬炸侧价宫甘泽丽戴鰭佐临董扎魏潮篇嚴慶融畢胜细杨順杰卢宝莉週厂卷歸泛健简毕识墓偏急避奏疑翼监况码榮井樹舍榜绝墨危败衣断套孙楊概虎肉呈宜捷瑪请匹珠階预啟譯执隔裁殖难弹購秦廉迎冷孫哲归雜驻臨厅迷叫渡毫涉億亮染池御圈豐乾減仙銷辑侯奪阻瑟彩琴付齊輸严析换葡恐氧俱贵函齐賓招伍洞碼麻　險闻寧漸味綱紐豪訓轮暗盃频奈昂麦症拥町吴尊妹旧享韦詩徵硬颗棲势釋勞俗礼冬崇圓藍凱蓋盖玛鐘養截徽树倒遺茲頂藥涅诗韋劳曹租錦財药楚鲜繁乙销液鱼盧借昭郭兹浦補柱输逝藤读晋儀优蛋估頻振顺乃莎掌鄭裂夠陶萄伐杂簽粉謝迁邀蔡滑討幼跨菜鼓遷裔浪腦淡絲併弱异拒適隸零菌軟廟币灵晉澤恢亿陷彼尽偶覺顶轨困旁虽赵丘纽丰訪患鮮却络障喬歡牧谢货貴競译審檢宿誌輛冲柯伤亨敵凯鄰埔駐昆勇桃徑阶沈敏壁貨签财荣疆伴祭珍茶挥紫熙搭允检講孟扩仔汗衝杯軌练衡課糖脈宅句促轻殊答审輻塘燃棒幸遍灰覆拆幫療乔幅額螺厚奴孝擴侍幻盤亂沉祥綠績讲鏡敬葬钟磁碑揮养訂械跑鳥柳諸寬慈棋顧訴艘赴庙餐宽晶柴擇挑启廢滅软葛减箭獻騎尖阵瓜幣姐聽遣宾剛诸妮倍撞惡襲摄释堅凡熟叛橫潘献懷桂慢艇访燕複伏折苦願『』彭跳够綫賣刀〉恒遂仰〈辽撒脂圆训补朋么匈须憲談伸险额枚疾尋齒钱敌靖腳夢琳仪雕慕购岡郑誤枪渐迅径買錢辆勤熊吃鬼輔粒谋旺鹿蛇賞頒貢袭罕芳歧詹泊适贡宪恆劍趣番乱夺莊损坎累础涯緣毁绕帮屯趙畔牠赞賴羊怀繪掉绍梯汇厄脫損鼠怪芝斑俊仲杉锡屏緯乳擎隶秒棄縮針拓晨藉浮豆腹幹玄弘陰臘紹觉锦废毀慧緒卓緊块蟲择饰泥崎痛滨揚袁爲隧駛杭壞插麼腊凌壽矿甸藩贏鳳圳咸竞旦苗陕宏卿謀喀讨炎筆塑搜绿阮暫曆笑戀舒墙盘亭貿隻蓝灭戒骑犹坚乏玻娛缩撰欢寄扬焦坊刚崔泳洗脱錯岳祝妃宙溶疗诉翁偉吕顆茂谈盡尉循袖叔檔邻觸听遜耀閣巧轴僧擬顾箱疏塊枝买霸蝶郊仿镜扮愿剂迴凤穩礎鯉勃靜彰坏契鋼盾盐綜既针輝赖蔣虫碳衰紧浩串岭贸齡钢潛驅辭蓮措砲丝捐横逢匯婦铜裕湯券絡床傅剩賢荒拳顏錫閉紙脑订寨燈廈譽错填迈搬純誉夷欣欲覽卜衍淮壇窗怒阴灌驱割沟丈珊災獸隱寿肥课综邨鸟狄濱逊恶銅坪狂儒旨误冊堪垂殘邮污抽燒斜妇獄静膜柔吾呂嶺冒税粗恰孤册胎颱煤陀疫迹悉湘栽蛛翠虛嶼娘缘儘脉赢廊獵鋒聘稿闭賀籃粹紋逆握駕耗婆猶弃陨琉潭壤阁狗剑憶肃稳倉纸潜拟揭貌薄挪鼻辞贊寒键俘绩叙笔寻辰蕭厘魂忍丙灾汪胸鹽吐璃姚览猪姬冯翌違菊储扶矩堆辅譜鯰阪籌泡稍遵档貫雀残苑碎癌兆贾刷狼涵淘硫邓歇礦奎怖慮芒繞棘誠添驚鍵貓屠惟偷弦卒獅稅飲酶軸押吏憑脊绘叉祀鄧奔姻殼寸逮狱峡屈郵謂夕蕨蒸嗣跡詳嫌仇绪磨醒卵娃猛腐逼縱嘴賈註笼肖颜勳牆纯峽薛劫烟斤伟纵讷犬誕邁卑隐梦贈触岗拼傾鎖劑勋飓氯嫁礁凝祠伽隋敘暂衔矛紛祿讯厦粵悲奶萧篮灯碟敢醇扁牵儲轟妙曰姜颁掘汤緩迦偵麟蟹姊碧媽忙馮鼎頁翔筹卖虚袋烧銜抑甫尹肌旬雍滕盜煙蒋汰圭忽裏虑缓砂壘株吹斐抱宰谱朴蓬龜汀幽稻擾髮廖緬汝胶巫珀怕晓恭虹茅拖貞掛吻丸沖硕寮锋盆躍詢毅邪寓崖蹈龄脚吨剪邑滾冈氢竟勵罰崩鄂抚溝囊抓魁茵讚俠莲腺託鍾鱸豫襄搖孕鴻埋辨氨巢膠蜂倡纹雌碩舌苯飯咖漁伙濃淺腔坂撫彌湿坝坛披丞扣吧挂脅栖吞蒲滩链违壮暖丑齿喪雞舟涌贤募耕挖邱陪潔瓶賜棉蕾暨薇仓酷谓溯蜜矮礙擅漠鲍亥缅閱耐札忘削仕鸡催帽喇姑详拱丛渠毗藻淑徹巷愈曉噴蜀胺屍唇昇琪噶枢栗掠鷹禄贯豹邵貼卸铺龐腾斥悬摧彻薪稀啡梨慣驾筒页踏鑑拘穴烯葵驶甜帆桓澄磷翅宛欽庶玲冕禾睡褐钦椎粮纷麵蹤販堤嘗懸倾恋惜赐怡赠棕漏宴哪诚润梵雇桐菩贺尿励豬弓柄沪逸鉴閩掩瘤瓷肺碰赏杆誓銘趕遞辉慎樞帥爪桌腿遲霞猎丧禦鈴蝠蹟弄悠姿框臂帅冀鳴奠罚搶娶厝磯淨跃疊锁递铸柬肢窄彥腓沼腰壳烷裸忆阅饮呎慰恨辯抄禪逻盈牲贞扭殷潤肩兔汶胁肝诞纲壯庇妖惊庚貧繩繫哀劣吊鮑猜囚祈閃滋朵埠彦遼阔忌臟娱浸頗眉辟炭扰槽盗診肇爬秩扇鐸凰芙霧嫩逾掃寇勁厥灘芭韻祐贫鱗瑚喷诏氟辩怎罷砖猫猴跋禧轰凭蜥搞弥趨崙嵌勸遮蓄椅庸庞糧薦夥賦彎瑜兽郁跌橡琼佑询晴鸿赶亩酮趁償焚坤擦昔挺摇噸棟荃鯨闊攜夸擺眠債茄踪蕃穗赋欄爸欠伪鹰迟喻駁鞋稣戌浓仑狐臉旱炳惯贴牽鶴濕涂歉攀捉瓊桿肅偽昏旭履氫闽浅漂櫻勘戊悟尸鯛踢橄抢碱醉爺屿爐璋栏淳譚軒裴臀頸怨謙禅騰喝塌鴨鱷帳詔氮净斬狹聰尝鑽罢滚缸盲凉狮荐斌渔饭睛厢喉侨矢秉艙躲霖瑙竣糕哺榴熔盒岐諮僚慘匠蛙妥梭窮陝咒阜酯澎鞍凸颇廂黛帖棚洁煌閘痕匪蘋辱勾绥戚摔蛤麓碍胆齋畜邏鹤劝侦漆匣菱椒涼虞崗賊徙携欖穌夾淵塗鬆腸粤侠楠欺撥纤扫嘛瓣漳棠糊铭哭浴畏賭寵虐垣牟庵瞄彬荆趋奸憂遙廿笛矶捲罩凹鸣擋韶嬰辣拯侶鏈酋朔奮憤僑幢蝦彗偿翡叠硝悼弧狭辐鋪駿墳瑰貪蝙誘玫寅湛杏噪橙誰涛穷螢焰咀乞禹滴粘舱暢惑磅纖棍堵閒夹脏膨胃赦窟氛纬韵膽孜鱂潰债黏牢銳燥餅冶卧壬塵撲摘娅酰樑誼鳞荊邸汁傘瀑诊橘戎膚懿芽鎊鵝懼沛畿摆垃淹奕塚梓滇冥匿剿頜輩寡禎茹懂谭汕炉颶纂泌肆劾孚圾俞迄騙詠渊穎雁簧萍荡鰻隙宦櫃鞭倪炼岑绵酬稽彙峻碘頃煮赣栋敖彝寂榆喊筋惨侄叢啤斋狸蘿勉蔽墩凶頌闸綁蹄奋乒泄窑】諡【荔酵鹃剌繳鵬茎妓拋萌蓉伺仗傲狩謠嫡墅烤殉籲籤闪訟谊苔苹鬚臭顷呢耿稚瀨樟曝僱琦践禍哇悅芦墜裹綿犁咨桶鹏芯壩拾淋墟吋舜仆煉癸婉彪貸嵩牡屢谥垒暑悔肠淀渦粟钻茜魅蘆喚廚愚騷啦蔚肿聊鮋衷鸦纺拨刪弼籠钠羌顛碗扑颠锐竭肪嘎趾毓糾淚饶蒿砍瘋樊闲爽薯硅蔓敷骸溃僕檀狙淫豚賠擠兇谦匡衙禽咬晰棱莞磚罐諧擒谐鑼凍鴉懲舅鹅愉蝕倭皖弊樸遥骚砌厭爛诱舖渤膀乓孢蔭廓腎釜蜘窩鸭郝諷斩浏挽炒弯蕉墾哩蕊剖渭祁褒瞬濾删榕穀淆坞杖壹岱厲扳畅钩迭莖歼締沁睿擢梗闖甄庐邯滤蔬蝴暹胤罹臥蚀烹梧胚俯婴猩紳贷霜邢輿濫绑敲沂祇尧哨釣堯腫脆漿吁縫纠猿檐沫卦缝盔陇抬娥塢忧崛篤龟楷剥鑄貶隕犀愤媛溥裙渝喙鯊饼莽耆疲谁苷瑶虏妈嚇聪謹铝婷蒼矣笠雯潟宠挫伞饒醛汐撐肋顱锅祺泗驳惹脹眷袍鑲晤錐鍋膝舶萼堀妾峨濁巾丟抹抛宵虜颖踐沧肚赔鬱黔窝涡鱈擲髓倖勿槟肤簿膛琅匾贬膏鬧颈嗎舆聂芜芹幌湧汾辜苍傍峙铃绒疇飼疼颂脸渴飽蚌绳棺瞭账卯煩睦璧醬巩馳堰渣鋸説鰓阎溢贼悦馨溉敕苞晃瘦冤奢虔羚晏戟洽磡攔婿挝羞菁贿磺讼阀漲闢鋁骗鹼竺惧吟侏枫您闵匙橢浆厉枯缴鰕謎苻諜啊濤贪肾罵詮埼铅瀏蟻讽釀鸚塾胀泵紮浑剝焊賺蠻犧牺麒慌醜酉榄霹闆锥懋纜岔氰瀕胖摸帐纏刃蛾屡辈駒琛祯掀丕糟雾岬惩楓蟾磐嘲傭酿詐禱钓慾坠梳鈞驟妝釐穹廁瑾挡諭艮紡鉛瀛帜窦衫忒錶侣皓菇丢棵涨淞襪糙緝骼竊斧兜綽淪谣倚抒鞏瑛钧咪枕兀閥祸蚤溴僵腕聶绣苣譴紗缀褲搏墮撑菸蛮瞻钥镶芥棣劲郸暱佣煥荀霉捨鑫溜汞堇焉祂饱幟茱浚谨芸稜炬戍緻霆舷阐哉厌轩霄捧谴賄莓嗜憾祕熹睹蔗盪祷堊芮衞攤靶祚撕滯胰艷陡饥翟隍〜抨蜒鄒噬冻魨萃恪癒泾篡洩钾鲸畴缪贩铎帛蜿渥挤曜曙蘚誦唤孵稠澀羟燦蟬鍊逗滲煽捍沸爷艰藓峭昊煞瑤姦尘淇崑滥谍箕镑沽虧湊俾敞綏薰荫妄閻皂偕栓澜巳蕩壟邹龚黜埤烃篷綴矽枣瘟硼〔烂〕嬪潼坟娟誅酚恕闹乍慨椭鈕疯鲤艱妨皋驰拦肽瑩蚊靼臧屑樱笨贖钙殲鵡麾俸吡鶯灶隅繹娄舵萝壺溺楞芋洼盎暮峪酪彤曦闡摺泣樺豎禺沐妍笃竖侮諒斡椰轎槐骤鹹渾蕴鑰靴鞘莆諫膳裘鉤滞濒雛刹艳鈔啸缔鼬缮滙謬譬虾赌釘鑒窃陛苟倩衢幡萱傀刮佬垦焕葫氦顎阱炫壢垫羲蘊豁薹蔷柑鎌湄滬吵煎渗奚庾晖磊砸竇谏濠戮淄沮腥燮炯厨呆晟儡埗烦蒜誇夭訥伶醚柜匀陞鮭餓隘琵缆巖谕檬汴卤靡嶽鲨毯沦謊吗扔疹蠟飄泪诛蜡镍廬咽垄墊驼敛冉琶胥繡嘆繆霰寰鈣叱鄞駝醋崁嘻陌肛鈉槳泼萎酱僉稷蛺姨証陋擱锌嘯翊纱叹驿蕙諱扯珂竿嬌绸垮骆毘惱咎瞿淤覓绰斃壕拐臼揆弈葱卉啶暉桅靂毙跪閔飘啓拷釉笙妆佚糯蒐龔倆耦峇沾莒兑侃悍侖悖汙蜗恤凿壶漕鈍頑轿朽嵐苛憩诵簇汲渲陂驕篆孺鳚苓咏埕鉅恥昧琰聆甬剃濮诈悚骏媚嫔椿駱愁砷杞謨芷絨衆跆隼饲攬珪褚昱窯悄綾畝掣兌坍甥哆僖寝栅滄绅臻傻潑蚜褶飢鳍檳茉绎圻侗捆鈾瀾钞毋攸盼瑋齣葆鳩贛踩雉畸濬妒瀚筠鰈羧饿圩楔谟歪蜴婭桔撼撃樵鑿闯躁锤灼烘锂殆勻栈〇俭遏鏢侈叡秃蔑缠皈泸鮨趟铀沅谜吓赎馈柵魄卅拂钉弩锯跤唸侬灑瞳硒傣嫻琮濂鰨勐倦媳蝸峯蝇綺鴿閏蚁産喃莘骂儉刁脾蚕鐮裳鎧圃洮毆訶亏胱碉夔瀧縛琥甦鰍驛鬍洙勛拌耍匆誣缉捞璽膺猷柿魮翎襯錘钊檻挾潞澈丫茛迥喘恺韌籽蠕靳蟒擄愧蠅燭潢賤襟婢槃糞钮遁浜钝姪兖軀邕乂岚瑕賃逵宸吼躺吠菅晦狠诬闰殭蔥妳檗剎熵粥杠矚阙撈瀋遴冢婁痴斛豔冗畑扈蓼酥弋鉀搁溧枋蠢昕昨唑嫉掖殴暈莪薑逍耻衬忻駭榔餉饋朕綸莺詛鷲浊曳阡韬岷谅蓟螯锈堕羰嶋樁僻儂虢掷昶澱訝隴瀉貂桨矯櫛絮氹铵黴囑藔鷺瑄鳅奘蝽璜蛟裤偃寢眶楨羈拙荧帧憐鋰俩涧輾佟撾妊潍篩醣讳巍檸嘱涿薨桩鷗袜煜孀邺殯巽幂鍛螂鞑馴曇馥匝鸽樽饑剔叭瞞篠咳坳昼烽宕沌砾顽惕叻绞眺槭叮璟璐綬颍麝捏歙驸頰郢咲桦熄皿尻铬啄慷戛渚迺檎礫莹龕伎湳蝨妲雏懶肘扼暇佃璞怜璇雳奄鎂頤诰鱇鸞緋銓鸠滔闕兗颐沱韃骄穫諺擂氓牒黯鮟掙皱禿绛蜱诃迂鉉鹛帘鄙尬炙孛攏癮茫嶄絞詭鱨谎鄱婺斂鈎屎憎凑咤鈺旻鞠脖餵晝碁锻丐惰诠炔吒婕昵巔摊櫚秤荼蠍鵑倘瞰笋筛曬玺卞崧瓯翹鎳艋蠶鲷祜舺炀旌綢懈劈揽荚赚淖麴缚灿旷怠聾拇瀝癱涪镁蝗祉呀鹦嗅悶玟睾劭镰愷撓鄺挠珉磋鵰蒴蝉沥嫂仄蘑榨佗歳赂抖撇淦螈槓亢滦鳄汛焘睞柚骷鑾蝎佘挨哮覃韧檜馏稼咐酗晒乖桢葦颅犍钛锰咕簾钴冼酌鬣泓飆鮠轅洒蜆熏鍍熾艏藜槿鄴髻鼩嬉铉骁瓮衮睢羯癖轍嬴遐葺彷笈龛躬锚醮镀嗓恬賂唆鳌橇燧謗滁鮃脩驴査飪粲蕈墘榈筱睽竄羹凋贻娠烛湍撿唔瘾秧腋鹘喆浣煒疣碌耽梢豈凳窪蟠佥澧瘫瘓瓚羁俏泮玖恼熬誡棧餡荠晕槌澡惇惶鏽稟摹鹊兮徘灸琨荻忱捻炱錨漩窖聿辗鼐寞膩誥屁甯鈦嚮洱驹寥妤徊甩窺醯氙翘髒珲缕苇亳杵鮡怯羨驯鎚钵懇郴娇漱贮蔔鹭釗歹踝叩摯窘粪訣鎬柩碾赁鋅檯泻绶弛撮筲苳脇崴疟諦娩喂窒蓓晷傢珮疵闾鳃浒謁唾柠筍绢愍纶蔻蕪铲堺簷脷厕闇俑顫栎蜓釧碇箴蜻骰歆诫戳賑桁薔曠洵菀轭姥璘锑呤躯镖麽邳僭狡镐煦盂浇饷澍痊畠鹉榛灝肄堃宥璉娑叟攘逕筵瑣皺鞅鹵蚓踞琢琬籬栾珈啞鯽嚼楣蝰娼痪孽絃扒貯儼虱畲筏俳燊巅楹胄岂紓帚矗蛭絹揉拢砚杲掏枉涩亘薈挣谬渎茸穢薊谒鴞繕粽炽雒嘔鸾恃饪逅搗珞蚂肱懺罔邂攪嘧栃猝荥豌賬奬婪氾鏞嘌榭箔巒瘧瞒糸韜诅輟杓覲霑黍爹瞎谤霓棗粱腈誹侷浔谿佤琐铂鸢菠岌抉滘祗溼辕袞漾蛹榻鮫佼檄髏聳閑茴鸥肴贱勖懦戡拮銃沔獾諏俐掸箏芎岙蜈挚烙焙瑠濑蚣赈岖疽梟醍彧瘡罂鱧吩醴鱲涇蠡鏟匕钨闍鲱悌喧鬃勺洄釁俚弒貽韭鯡恂弔羣鯙啼鰂噁辍柘栩钰靛馀弁紊罄靚鄢峒滸瓘咯氐蹲餚嬅瑭羔驍醐寛艉醃瑁谔桧垢昴萩酐噩幺珩儁膦夯鑣疤稔鰲媲庠荨躋鄚鲈镕彿眩鱔腱琊糜腻遽剋栢睐螞鳖闷疚佰焯颓驃觐昀纥挟餾舫捣瓢甕耸徳塹搅涟蜍癲謚邛蝮沭絆鏗佯呵涤嗽萸鉑呕繇绮掺讞魷俟冪矾貳軾鸫頷菏颌湟珥齦娣憬澗驤袒嬤漓懒脛螃鉻頡嫖恳揣皎矫譏戦睫褫锺漪匐囪淅驊诡驢嵊壠瀆辻隗敍褻垩戸歎瑯筝觅餌魴吶隈驥齧潇诽盏滌烴痘赓哑骠湮璿蠔筷鵙儸癡邾緞钼掾帷訛咄櫸匍珅廍煬詣鱺囂炜痺鹫瀘臚苋铯缙羡緹羥锣嵇慄玮铨痰邈ㄧ簪裨啉嫦鳗耘喵郤嘩囉涝賁缽钡鰺垛絳糠逞邠鉗斟漬讶様摒瑗嗚尷嫣腭邃疮崭憧濛顗鹳聋軛轼闫拚衅趴螳晁尕碲錳潁盞奭鵲昙蒯萤郯骥鈸靺凜絢咱渺砦萘橐琇颤嵯胭匮嚕栱鞨盯贲撻赉跻钒勅幔玳瞩哗燁縻阆亟珙秽稗獺瓏頹鳶囱峴璠遶銮棻釵霾馅澹蹦俨屹疃涸鵜鯤蟎剷忿珏诲郗髦扛柝猥涕澂猖瘠県硤芩砥贓鉞玠桀櫟炊笏繭榷钯駙梶揀钳孰珣嚨匱妞胪颚盱蕲囤殡偈譙弑豺岘褪阗岫忏晞箍鋤苴縉镛癫専菟拗璨茗诣痢誨谯绯藨谘鴦帑恿暐鯧浬鯔乩刈獠葶訖榘颉鄯犛獐熒猕癢讹込麋澆窥蒨鳕亵砵甾藕馭儋哄綵驷恙煲璀腌铮墉腮爨閹陟钗庑煊笹鼴鸮嵋碓槻涓漯謫瑀莢瀬薙蝓楫翩菈蛞逛鯖楸溅毎爍耙蛻郧燬谚郃恽櫥湃燾甌耒俺憫骅呋慑枷轶壑憨蝌铋馱汜痹阇曖淩濡焜銹钚啮摻燙霏嚐蚪轧閭漣犢颊燎綦镉噹敎楯踵鄔鐳阯曄桉痒紂缎鎢喱鎗尴歿肼蹼錠氈窜幀赭魟鱉邇鴕唁塭嶷槛閨箬鲀忤柃眙縊錮骊擷膾釷欒蟑鹬殃綻銨顒鱒猾臍蒾陲僞蜚贅咆絶輒歩猗菖醌翱郓鲫揪昉歴禀脐蚶骡侑愫氘氪覬镧龢峠蹇铠锷喹坨姍鎔飙瀟烨瞪勗瘍閤鸳缨荖荪朐紜雹儷嗪圜坯鶇赟鮄俶锟汨鉢鮈辮錡呐阈旃菓镌剽瀰禰坵彊徭挹纘雋恣蜷赃姫滂鄲炅疱缢軼鶲煇畈脲倻蚵碣菝鈹宓旼烁鳢哌揖粿蚩獗痞睇鹟孖莿癬蚺蟆蛄藐詰躄鸯嘶翦銼骇曷谛豊僳硯竑篙軫钏掳涞椽谌邬嘿攣睪羿脯黒朦痫纓椴癇嘟噻捩蔺蹂饵埭跖膿嗆潦垭嶠玷瓒诀髯傈嚣墻暠祟蜑鈷锭骧厩醞鴛挛铊滎攒杷琏恍憚瘀笞綝辙凪墀鮪晔槎玘碚芍楝殤悯窿毡坷惺訢隽燉葜詬铰燼蠣崂扉氡狒郜銫銖騫冑橈峦晗讒夙栉滷荟洺潯爰紇倬娴弭淝輋枇蠱褂卍哼塬灞芪莅閎佞僮愔拴吝覦惋藁蜃伉岀蹊驒髅氚傕擘垠寔梆牯猬讫軋鮎汎苄蓁蚯铢驪豉酆沆陉孪崽骈徠樋砧穰镠勣蹠繽辇鶘懾朮箇紘鷸麂楂稹萜餃槲蛸跗铣鞮怛琚璣篱辊捡淼溟玥芾蜕戾竅邝颢鼱璩筊銣灏訇鄜関鳉獼顥晾痉禛臆舂蹴嚎惣蛎迤钜縷繃讥囓垓涎膊苎吲沢罌駢濺砀袂疝菴裟孃崮樫蝟鍬铍锆鱘慤搓绫鏘殮蒞簫蓑錚钺闐啜愕錕袈嘅巻暄筐袤秣藿搔撣泫痙绊酝鳐哚嵙毬笺贰闺顼拭沓蟀骞亶凄玑袱増瓌祎菰阉濯廝殇厮哔祛蓀蘸郅埴榎珑矜蛊霁虬辄録佶奐嶇踊鍺铿僊噓杼眞腑詡遹馗蜢蟋郦刎刨喔烫蹶揄诩鬬拽昺辫佺傉僥泷罡锶寐栒焗砜綑銬钍儕淌篝錒铈锄鯒鲑泠眈瞧钤饺冏嵴発荳譁晩蔵詒咫犰狳藪隰驭姒憊溲睜舔赡慫柞椋瘩謇鰾仡廩敝汊箐荞嗝枭橱疙眨嗡暘洶砺磘脓簋賡鎏靓獴璁秆繙褓跛垌禕贍邽渍箫闓鯪樾汹邰鯷鹑囍嵬徇徕澶疡瘴稃鉸㎡茁諤鎰闔鶻䲗哦嗶孿苾讖馒淬牍苜詼隷驮棨苈萁蠹淒绾胛蘅诟鯓溱簸謐霈劵滏犒諳龈凛炖銥阑飭喋嗇圪蟄傚揶貘酈顳鰧冇啾坌愨涣蓣辎咁壅泚藹躉顔毌畹疍蓿诋軻鏖皝鈈倣粑谪騏兢诒黻櫓礽鶚骯媧捶洹穂輅轆勲渙钇鵠鼯啃烬詆饅侂茧葭褥謔恵糅觴镭囿姝廨慚苫鈽噗爻膑舯阖喫弢蔴銑闌鳟勰榊牴芻咩鉄堑婧拣磾簕唧嬸嶂燻蛀鋯鱚ㄨ佾刍嘢塱撬窈蔘阚鵟峤棂狨磕祆椁磬苕蒽蜊閡纣藺琺贽冴枸焓膈蕎酣鉬頊鮗濘酢鍔囧惫懊疸紺绚舘搪芊輓邙郷孳榫疋缬罟逖㹴仝殓熠箋蠑嚥媾悸拈攫轸霽円燿脣苌蛆鏐饗髹鲃镓掐楽沣焱萇葳锢凈惲洸魘佢炘睁葩亙呜皙鉚铼鱥幗慟桤玹瓠翳駄氖迩鉭魣枱蹬奂廪荽菘蹺飚坻搐湜瓩鈮镂榧瑷糰踴郫鎵锗埡泯缇胳蒔谗隣颛ㄚ廸惮牂蚋螫軔鎘鲹甑痲鍀舛觊诂伕伝嚙姉胧鈿閬闿雎髑鯻赘倔挞塩饬巯痣礪薏觎鹀稙虻蠵趺靄姗瑱硐蝾讧頦鲆榖鋆黝黟乜仞睑羸铟俎砭碛咭廡枞琯轲釔鱟暧牦鳎垅惘濰蘄屌磧酊倜諶鄖鋂鋇麿黼俁娲扦溆睬輜鉈驩龑侥嘈実幪瀅竈讣閂効燄湫牘胯郇鄄鸛鹞噱濉磴稈缵脍鞣仟俣啥嗟笆躪輦尪胝鬨鲟卬吮痔肟荏鍰縝肮芈螭鏵卹捅捺槙蛏鍶呦呸怙柊癥耜诘鼹噌嫚尙珽砰祏铌頫啰拏翀钕鬲姣粧剡徨栻濶莨衹訌噝壆嬛朧炕芗逹铕綃舎襖逋剁喰窰芫鋦呱坭埂犊郾鏜锴鶉埒玆鰹丶俪籁緲翥螨訕佇偲嘏嘘柽湣纫豨镳韫鬻鱀鳝砻蛉铆锕嗲縈荩闳鲇仃獭蕤諲鬘妫孑嶝廆怂鄣圉殻瀞珺睺纭罘荸蛰儆劻埸塽昪涮濞緘裱锵峄颯炤閲鸪鸲唄圮嶙浯訃饉堉氬胫芃ㄇ屐胍蔼諍谑対枳豳巂溏腩诙鸕咙嵘舢鋌钌呷嚏濊畬砹碶荛铐啲嗨団擧蒺鋐阊煚矇窕紉鬟鲢哏宍崃炆惭燹绽铑铳鲂蠊騾晸総褔鹗楙樗葯錸鏤々嗩煨珐莠薷鄠崆熨谧豢辺逄雑雩鹧墬榉沩盥鉏颞鸵劊呻啪嬋廕柒秭粕绷谙贇颙劏槤狽薌鏑鳀璈翕芨詧邡郛噠殞淯狛祢綰耨铷匏噜氩滉祔窠衊谶鉲鷂戔瞼芡茯贄蹋迢錇鐺揹昐绀顓髂峥戢撩瑊篦綉賚邗酞鑭镯鹌哎掰槊殁蓆蓖袄豸闼髭伋恫憍昰笳臾铽頼鱵廄烜狎铪镨鷄俵咧桫槺潺赳逯銦饕唬悝惚瑈镒鮰鳔鹩咗樨猞琿臬峋踹遒鲲鲽鸻娓渌煖猁痤糍舾蛔衽釩枥螄襦阂髖鹈圏禩笪謾鱯凫咔硖縁薮袴噢忡朊枹貉鍇韞劢峁栝碴缄鑛懵烺瘁菽躏鱿炁絀缭钐饌咚垸孱箝覡崐悫戕梣狍鑀卟妣帙渟襞郞钷钿鸝黥摑瓛缜蚱裒襁豕吱売浐禑缗腴赧哋茔鐲唭嵗庥灤茌諴貊鏊鐙丼圹媯捒浈癭莴鋹鶓汧皐磔罈釤銪揍気玕畋瞥謄閼俅嚷杳欉痍箸萣訐迸鈇頵髙鰩麸黠埵渑疥痂皰郏钹顴䴉凊叁旂淠滹灃硃礴笄纾豇遑郕郿駅鲉旸満钪锉雫劄戇誾迳鋨镞鹄洎浠犸獒祓窍鐫鶿圀垻絵罽胼覧铱隠颺骶俦啖崞怿璆筴胂苧詁鈀韁鲳鹎仵廙汭牻蚬嚈恸淸畯眸稲篾臏倧埈崢懌泱燏竜蛳酩壙悰硏逑銻鞦飒鴯䲁卐椤毂獬縯葷閾韆髪〞嚟垟橿獁筮繖鎭驄嘹橹毽箓粄闩鲻䓬俬咋嗯嬗掄柢犄篪籐籟钫齶舐裾闘霭嘜寳悴瘙纍肜鈐鑊頴摶涔籙莧蟜摭攢犷蕁螣蟳铛闱鲮偁刽寘庹廻戩扆斫淙滓澥秸胴遨鄆钽镝黧嗔噲捱桷籓銲髡抜琍畦紬緱萵觞跸霎餮〖〗ㄐ圯垚峩悽愎澚瑢紱繚蓍蠲讪跷鸬弇怦暎泺浍璪盅螅跏両夤渕甙菑谄邴倓叨栲畷礬菡鉍钆哒媞廞暾瞋竦笕簃缤羗茆迨釙鑠锇阏麹〝値偓咿熜稞謳阕饯鴟嗤坩徂憔眭蘧鎓鬩鮀囗広徴憙暻癩腆腧蕗骘鴇搵毖畀蚴馍鵪鼷卽姵彫梾熲獷玢瓟瘸飴魍鹚佻勔婶徬焖聃锝骐髀鬢鴝崤拧洧莼觚詫鍠餞騁ㄩ䱛冽岢帯檩粳苡蚝锜冨啬寀嶲牀猊矧砒薜誊镱闈騭鲛嬈扪樛権烩珧荤骜劼琤盩瞽蒟酃隹埜愆槁禔諂讴銚ㄆ唃梉楢泞犂犨玎珦璹甡甪経臃薳蜇厔吖柰澪琹篁臯譎賾仼哽抟捎浞痿禳缯舨衾诹辋鐿闞鴷鹮暦棹璲瓖肓茀谩鍚鮻鲭哙堞嶸碭絛菪蔹藎踰钬陔鬮魋鹕啻朓笮絜蚡鹱勷浹烊狈璥茭観谀赝銶鍼鑪駟ㄢ巿掟曽栀燐燴窣虯衿鑷鳊鴣卣嘀杙赊餒鰐曩渉痈遄镗鰳ㄠ倌凖叼嘖嬷狁璦癆癣硚罨翮鏷ㄑㄒ亹凃囝嫄応熺畤蜉袛铥陜髋乗亓傩匄纨蒍藦譞贗鈑镫陘鰤鷓ㄝ倮唛幷捫桜楤櫂皞耧鷯ㄥ嘸庖彀暝桕槨沄緑荬鄩钋頠駡騶ㄅ乭仮俥僰唷囷暌暲涑潾翚蓥蹉骋鱝鸱嗒垵変幄彘撷桠歛璝祧纛醺鑌鳙鹨鹪ㄉ勱帼挈檨燔眜糬翬虺鬓鲵哷慵旛昝晙棐璵籀縞萦螽韪鰃鲣鼇堦屜栿滢笥鄮噤嬿忞斎煐綎纮缶諛谠酎铒韮魑鲎嗑噏婊慳榦瘿瞌碸蒗鍱镥鯿ㄜ㚻伷掇旄癜纔覷铤锽飩鯢厓収唵垡斓沘縠缰蔦騮ㄎ婵擀栞楮簍胙褸赜鉦闥骝麩傥埏埙晳椙澐牝绂菉袓貍蹙鈰餛鰶鸨ㄛㄟ剣垱戬搧昃栄绦螟襠跚釹騄鲧唢娉恚湎漚玙瘰砟砮舀薫诤辘鄘ㄌㄍㄕ喳埝拄擰珝罍襬覈詵铧魇鰱捌昞碕繒蝣讃鐇霨鬪儺児唏夼抡攙晧湉礡箧篋継轂辂邲鈁鏻鳜偌咻塲嫪嵛掲紈纈罃罅闋鞬魃仫壊惦拎淍狷璎緡覇訾诜貲鋭錞鐐鬯鳧ㄣ圄妪屉惆浤瓔竪篌蓨貔遛鎡髢鹋麐匂喲廌捜枏毐玨菫蕰虓躇郈餽䱵唉囹嫘屄杈泐渋癟羕艽葑諄軚遘鍥颀鰋鶺ㄏ撚浃瞑禵粦缟膂覘讎讜颧颳飨鰏鸸亀儔啹嘓垴塍媵獰璡蒻譟頎偎喺忐忑枧癞盦禋箦菔譔蹭鑨鳾侪喾姮朶梂璫苅蝘釦馄偰囒垕埚廼晊浄疠筧茍蒡鋮饨鳯ㄋㄓ俛垍塤姞徼悵惔抃朏玦瘢舸蓴佉卮哂堍塙悪揸缐訏邋銠錼鍘鎛铙ㄈ䱀啁廒懽玭瑒砬謖醪亜働厰囡寯嶧幛怅愣愬搀旖晛爿瑑羆薺蠋袪趵鎝ㄙ呃屺悧掞旒澠煅皑箜紆縄羋遡遢鑥铖餗鮒鰟塀壼尅怆懃暊燝牁珵砝繻荦谲赍跺蹻驺鱊鲩埇嫗崚桴棫沚溞禊籮缦葰薤跩鎶顬験鲌鴴\u9FEB傒剜嘮嬖屻悻慜搾摈濙瀍煕煸犽皚蟶轫郪閦霊鴆鷚麈堝堠晌暕梔橚獣皴繋诧釕鲠鵯鸩ㄤ伫叽呑怏掮柟梃殒璄繸諉鲶麇鼒齢図掬棡炷簣翙莜葎锛驁哱捂栌桎梏椏瀹爌礐纁荑醂銩镎陬鷉鹂侁叵壎寤惻昄椹澇澣癘禤続艛茚鄫鉿镈颡鮍処呾哖恁撂斕旳椥洌溘烱糀紥缥舗蹩髁黐鼋傌厍呔咥噎慥撝檉泖澁瞠窨缫芴蓇蕖裆酺颏鲡鲿ㄗㄞ喼嫺敔暁暸梘淶溍焼畊磻紵芘荘荜藷褌鐽锹鰷鸊龋咂坬宧桡滝潴澔砼磲緜罴耄葖褙鐃鞞魎鰆勦囯妺嫵廵朥檫湔簑縐苘蟌衎觿譫鎩鐨阋䱻吽哟堌尢崠憋攞旵棪槱櫈歃泅煃畧筌篓莸辔铄镣飫骙鲥嗦懐杻涙淓碻筅蕻衪賛贔蹕躅転镤鷴婼庁彛掂搥旣柷楩殛淏狞琄畚蟥衲読諗锎騒鯆鯭鷥鸰黌齮仂儻吿墕婀弐忉敉櫪漈珤癰竽蓂蘗袅赀鍙馁鲼鳏倨倶勍嚳廛扞杪棓洭瑨紞茘虉诨逌逶郟鄀鏃陁鞫餬鴒鵐ㄡ噍孌孓廋弾樅烝絅縵蕷褡釪餸餿鸌黁龠ㄔ㶞佝劬壸姶巌帔彆恻拊済燠瑆糗褘詝酂閆韡颎飏馔骢鳽倏呛営嗷嚓崱彅従悛愴扺掴柁殄澮炟珎繐苺蠓诿貙馑馘鷟嫲攆斝涠溇爀狓矸蘂鑅魾鯱鲅鶥鹜黽㦃侔嗢塅姸廐搆斿昫桄漥疔疳痠磝穉竝缑臊蚨螠跞躊醢阌佖刋嘍奁攄洣浡漼犖羱芑蚧蟯蠖袢襌賒鉝鉾鎣魢鰥ㄊ㈠単卨呗彖彜徉徜惴摳櫺沇湓煴燜畛秈箩簗粢糌縹葚詎贌釴鋕鐡魈鲔鶩黷㈡偻啷嗉嚀夲媺幞撳朿枰椪欸沏浉湝玁痧筩絪纡蛱覚讦釆铡锔鞴韙鯀黉伾坮嵒彔椄樘浛盨禟绌蕡蘼蜞謡貅赕迵饽鷦㹢㺢丏喈嗄崍忭憺挙摟杌殫氂洨溦潽牖瘘瘪穏筇翃肸萮衕謢譭蹿軏錬铚鞆頔顙鱭鸷ㄘ䶄凇刖啕岿忖懣暅槰殳溷猙玓甗疎箨蜣诔貺賨跣蹣鄗鯁僎劓吆呪啱孥崘撘栳淛濩砫祊祹绉裿襤觑醱飈骺鴫鵄鹇䴥咝媪搡柉櫞氷泩湼腙茈螉螻谳醅鈧镡隄飡馕骀鵾僂唎奀嬬岜巘愜戽擯旎曺楦槩殚殽泂瑺璮眦矍砣穡籛羂聴虿訚趸逡鏇锍霅颔駆駰鱠鷀ㄦ啫喦嗰嚭宬庯廑彠悊愾搢搦撵杣槠橛檠歟汆渼潸灊焄犴玡瑫痼礑穑粼縴绔衚褛譓鎿鳂麺黡齟侘唠嚩懑搂旰柾欹浿焿珰璂窋簠舲茼蒉蕓蕺誄輊迓鍈靬鮁鰜鲴麯鼾齬ㄖ奩娍婬搠撙晈槼橞欏欤洑漷瀼烋珹癀秕糶緄聵蒎蔊薗薬蘖蟱衄觜鍆鐧鵺ㄭ䜣刳塋帰摠梱槇澌熿狰翽膻莳诶賅蹒轡轵鐔饴驎鳈ㄫ㩲伧坧堈姈姘巋徧忝悳挎検汩浟潋瀦狃瑔睨磙笫绹苁蕅蕹蚰讉躑軽郳锏顕飑黩伢儦兕厙嘰墁屭惪憕拶掎摞斲昜栴梿沤溎漑烔焞筰篥簞籾脒臈蕚鈳銛镬霙驌骛鲬鶼㗎䁐俋傜喏噫娀戗枓桱檟檮溈澯燫瑮瓿瘗禠筼缛艶镏険雠骕⿰䱗吭唳啣堎庒惬憻攥棼殂滃瀲焌爚狻琠琫痨瘞礮礱祼禼竩筜籼糴脘荵菼衩裢謩讬鉁鉆钶黇鼢齎仉仳垧峣弉懟曔杧炻爝瓈硷禨籥糺絷綖聒莕谞鏌鬷鸶麊麪鿕㎞俌妩娆岞巉抠挵揑攷旽桲橼檊櫬殍氤渫漉烇狔玗玶瑳瘉盹綷缃缈苊螋蠐赙跎踱遯銭鍅钲镅骃鴈鷿㶲仨佧倞偪傖勑嘞妁娫嬲岈峘嵎忾戧扃捋撅撸晫曌杬柸梠樯橦漶犠獍瘂眇砗硇禥缣臓艚荅蒭蕘蘩赅釓鍪髫髷鮣鯥鲋鳇㐌䗩垿墭寊岣帡扱楧樉渶漴濼犼猄珖琎璙瞇瞓篑纻覿賸鄶鉷钣镊饟騋騤鰣鲊鲚鸂仚兎咾墡媼嶍巰暪枵栂椆盍磜稉筚籴缊罾茬蒄蒌虒蛩譲讙踉輶郄鄕騅鷈䳭亻倕凼卲咺囃圌埧妘嵝摰撄旿櫆滧潏澉灕玧琡睏秬窓箒粍繯翺腼茏蠆觇諝邉鋃鋗錀锲雝靑鮸鳡鶒鷙㎜䗉僜冚匜叆喩垤墌夬妑姁庲炌猻珫瑴璊盉盝矞秫縟縭耋膘蓊谆谮踫軨軹輗輥輳鏸鏹镆鬰魩鼍㈢㙟丿侹埿彄抿擭敫斆榿氿洊湴濆猃甴眯箎篳綮耷荇菥衜覩誔谡邆邶錾阝黙黿齲龎㸅丨仏倂儇孋寗岵嵕幃慍慭抺揩旉橒汚爟牤痱硨窳筈綧繰羶肏肫艸萋蒹蟛觔觥詥貒鄡鈃錱鎅鐄鐤镲鵼齪㫤匋呉喑喟嚦囈圑堙塡奣娈媄崄巣帏恊愒愼摁摛擡昖曈曮曱桝楗榇檣檵欅氵滠瓉睚碏筦緖缒聩臞艅艤莛褴誴讌賔賻踌轺辏辧錙閶靦䶮侅侩俀兪冧厷壱奨巑幘栘氽沬泔玚癤盌眛磎秏絺脗脬苒蔞蛐蜩蝥蹑釭銍驀骖鯈鵎鹡ㄹ㫻僔啭喎塄彞怵悱戯拺昚栐楳橓沨牾猇獫琲璸瓴睥矟茷莩譖谵賹酹鉨錛鐩钎颦饹髕鰮ㄴ䏲倀刄咇圧埰堽塏壂壐娸嫫尒屇崀嶗庋廰挻摽擕攴樻欞泇湞熥犇皦硓箪縡聡艟茑薁虨蝲裊觌詈誑诳跂跄鄤鋈鎇鎦鐬顰馋騖骓鯵鱖ㄷ亊冮匭嗌埨埻墫忯悆慇捭栟椇榑榼汸浥浵潆潚瀠炝皤砈硭粜绖聼舄蕯蝀諢豷贶躡輞郚鉶鏳锫靨靭駉騨鵂齕齷ㅇ䳍佀価儐劌匚厣垈垰婓婞嫱嵓弨拝晄晡柺楘檁沺瀣獏疖硿礤綯緇縂脢舁艨葇蠃袆襴觋踼轳鏓鐶锒隳雟颮馛騣鯇鲘鶹黈龊㷿匽塆墎夨妯姹娌孬孻屃嶢惎懍戆戥攽柙櫨氕氲泝滽瀷焴爕猢瓐祅禚穠翫荎莶藠褧觯誒諟讐谂赑轀鍟鑴霦鞌頲饈馃馺馼騊黾㟖㭽㮾㵲俓傧僙僩労厖叄吔喁囲圞埌墼娡寜嵖嵿悃惓搽敻斅曕梴棰櫱沍涷溁溙甍畇皷綹縑聦脿舩蓽蘢蝼訒誆趼鈊鋱铫陴隃霫餺饃鬈鴗鵒ㄬ㚟刧嗱嗹嘥嚶圴壝妬娳孮宄弖憓捽掦摃攖旆梲洢滈猯猱碽祤穟緙繅缁羑翾蓐蓯薴蜾蠼豲蹀躂辵鏦閰阼靥飥髌鱤鸹〃〒䥑凴剉呣嗥坔垞媓屓峃崶廃彳忳抦搴斉旯晢曁槚櫫渓炲熅甓癔皁箣篯緍舳荄葙虵蟴裇諌釺鈜鏨鑃韠韺饸鯃鲐鲾鵞鸑龃龉乸倅倢刣噼坫壪妠媜屘峅嵵嶚嶴忬怱悒愠慝懔拑撖昑枬梫楬洐淥溵滆漖狝眥睍硎磪礅礓禡簒紕絝緤縳纰蔿衒襆讵趒踎轘鉎鋏镦閞阃雱頇駔髎龌䃟䲎剐叅唫唹喽噉坼垲堮墱媖媭嫳屙崒幵彣慆憼扥敭曧枡榣溋漒潕熇珒瑸璛疐痳瘐睒瞫礒祘笒筥籜粋綞緗绺罣罸羖脳蓚蕞薀蜮诐貤趯轱辿酇酤鉌錝錤阄霱颋騂鰛鴰鵷鶏鼉ㅂ㬎㴶佮俍倈傃僴刼厳噚囘囟埽嫋峧崾帻忸愐挿棆榍槏櫧洤洳淎滍燨牼玒珓瑍瓤甝瞅窅笱粃紑绲胗莰萆蔫蟈蟊踨躔辶郐鄾錟钖铩頍颼餑饞駮髆⿱ㄱ㴱伃佋佷倗哐嘭嚢埆堿娎婠嫈宀寃寍徫怔旲昹晪枟桯椀檡氶洫熈熘獇獛珷眕祩簏缂舣芐芰茳葒蓢蛯袿褊褕褞謏賫躒逈逎逨鄃鄎醵鉺鐒閪靉黶鼈ㅏㅣ㥄倥儈剳呙咢咦啯囎圕婤媿嫮嬢屣崈嵰嶓嶔庳摀摅暤柤棁椑歊氆湋焢璚畮疪疴瘼癿矴矻碡篔簟綣緁羾耏耬聟脤臠舭艄茝菻葸蔟蝈踦踮迆逷邘釬釿鐠鑕钅阬顢馓駼騑鷰鹁䓪䚟仛卌叧嚤囇夂妗妸嬃嬨崟巎彡徸慼搨摂昻杢枴栊栔梼椟楡槪檦汫泃漎燡犟猋玀珔琁琜瑬璷瓞甭甽痾瘕瘜盋眄祾穋粩紃縋繾纇纕翛脔舡蒓蒢薾蟪蠙袝賙輄逦鄅酏閧隲霤鞗頽駑驫魉鮐鱎鱣鳓麁黗ㅊ㘰㰘㻋丌亅伥啧喨塜塨壻妏寖尨嵫嶦巹悭戉戫戻揼斠枨栜棊椚楶榃榽毳氳洴渢漋漙潲烒烚爔犭玪珌琔璬皕碥禘笤笭絰绻耑苽茕莙菹蓦蟇蟷袷訳詘賧轤逺邐鄋鋩錏錩鍉鑓鑞飮駸騧魌魠鯮鰗龁ㅗ㕎㫒㽏䄉僡卭厠咛噥嚆妌婑嫠尫峮崦嵚嵜嶮廧弌悺慊挲掊揺擤旮旴昍昣暟棅椼楒楪檞櫲欬欷歯浰涍澋熀熛犏猺琈瑲睟禆禇筳糢緃縦绐缌罊罳聱艎艹芟蔎藴褵覔觝諪謅謤謦诓貎赪銎銙鏼钂閟闗霔飧鬭魕鯕鲕鳣鼕齏龺\u9FECㅈㆍ㙉㬌㮙㻑㻞䁥䣓䫻乪亷侉侊剮卺叚呴嚞壌奓嫽岧崋嶅廮愃掼擣旡昡晅暶柶棩櫝櫾氇氍汋沕湌漭潖潫焮煟燚燵狶玼瑧甃畳眘矔碙稾窴笊緦縶耖脁脎芿荂蒈蒥蓧薅藟衖訄趖踘踭蹌軺酓鉕鎜铦锬阍霬饔骹魖鮚鲦鵖麃鼙龗⽂ㅅㅌㅑㅕㅡㆭ䵋佽僬冔剴劒匁呌噯囫坖坰埢墈夀夒夛娙媃嫕嫰嫿屦屨庀愻慓慬懮戱抔揲揵揾擐擥敳梡棜榲槅槔槜櫳歅殢殪湲滶漵潩煶熞熯獪玊瑎瑝瘻眅矬磱禖禬禴穣簀綆綪羝翯胬脰臑臶舻艻艿芛莃菍萏萡蔀虗裲褰襜訔貮跽輌酲鍭鐈閫隞餔駃驂鲯⼀ㅋㅍㅎㅐㅒㅓㅔㆬ㖼㴭㼈㼎亠佂儞刕哞啵嘤嚧垯垶奵嬡嬭尟屛岏廔弍徤怍怤愽戣扜挼捴搋撦擻斄櫍欐洈浭湑滻澫澭澴焻牋犘狲獃玏玾璺瓓畵癯瞾礻祋祫禓竒糉糎紿絣絫縢繊缷罝膣艼芏芚芼茇荈莋菂葊薲蚖蝪螲袾裰裼褭覊誐謌謜豋跬踯遝鄳醘鈏鉱鋋鋺鐏鑁锿镟閙隤靁馊馐鯝鶆鸺鹖鹠麤ㄪㅖㅛㅠㆢㆦ㎝㝢㮵䱂䴈侒偀儍儚冋冩冫剰匸呲哝唪嗖嗾圐圙垆埶堣壡奡妧寕嶌嶹幤彍彚愦払抻拠挐挢摎摵杩柎歔氅淐淲渃滟澙濋灋灜灩灴烶瑂瑅瘺矓矼砑砩窻箅粛糁糨絙绡羼翈膥艫萳蔯薘虮蜧蝻譌诌诮贋躝郙鈒鈥鋉鍗鑢锘镔镪阭霶鞲颃饜饣駘駹騸驽骎鱙鴜鶡鷳鹍鹣黢黮鼂⾺ㅜ㈣㎢㕭㩦䄂䗴伇侾俤儗儵劔卋咍咼嗬嚚嚿囥圬垾塝墒墠婻媁嬙寁岽崿巃巆帢晬暀曛栯梈椬楕歂歜歭渽溽熉牓獳玅珆琕琭瑥璒癧皛硗祦秌稭窆篸簖糈綡緈繮纟缋翜翷聨胲茖蔍蕢藳藶蘘虘蚆蛲螵蟫裬褆襷觱誚諠讠踟蹓躓躥轢鄹酅醸釈銕鋡鍳閇閽韾頞颿駈鬶魦鮊鮓鮶鰁鰼鰽鲖鵶鶖鹲黹ㆡ㗰㘵㝬㞗㠱㭎㴐㵑㺭㻗䐶䵍倴傪傯兟冖冦凧剀剅劖勧卄厯厶呓唻嗏嚫囔囮坣垐埱堩塉壚嫒孏岍岠巪弳忄忮憯戤扵拡揷擞昛暭朞枖枲棖棷椐榅榤槢樴汈泆洇涫淰潪煑煓煿燆犫狯珘瑹畎畺眚眵睗瞀禐秺穇笵筻簌籣籩粝綀縕绁翂肈肭脞臙舠莤蘡蘵蘺虁虖蟧裀裖襃襉襍觶賰趆蹚蹛輈轓遫邔邧釒釚鈖鉽锞锳镢鞶韈頏餜馯骟髄髠髳鲏麑齑ㅁ㎏㑹㒜㙔㝅㝉㮣㷧㷩䐾䗛䢿䤈䵺亍佴俔俽僇凵吚呒呠唊嘵嚻埓塈墐墺夊姃媟孁孆孭尃尭岕峼嶐帞幇幚庼弰弶弽彐彟怩怼恝悕愀愭戙拃拕掤揃搣撀擿攟敇斁杁枒柍桮椳榚榟榱槑檰欓洿涴漌澺濍灂灉炑煆煋煠爃爇爋爓牕狌狴珇璻癈眎眴瞟砳磏磹祃禸稑穄竉筸篰綍綳纒缞羮耇臌臮苨荁萭蓳蔄蔕蕆蕸薢虩螔螘螬衂裛裥褍襕觏觕谼踣踬踽輵轕辀逴鄑鄟酔酖醖鈵鉋鉟銏鋟鋬鋳錣錧鍌鍝鎋鏝鏱鑙钁钭锱阨陥靱餼饢馇髟髾鯸鱄鱓鲞鴐鵩鷁鷇鹆鼗ㆤ㘃㘭㝝㩪㬙㮒㵂䂮䄄䄔䰾䲀侞偱傴冂呖咘唅嘣噙噦囵垇垔埫堨塰奼媗寈屮岊嵮巄巛廎忪恮恾慱慿扌抋捦掻撺擼攵昤晭朒枌枿椝楛橂橺檍檝欑欵殑汏溒澨濳濴灺焐煣熚燶玔玱珄瓅疒痆皡瞉矰磉礵祄禶穨窬竃篼籖糭绠胠芉芺苤苿荋荭莚萐萑葅葠葢蒇蓘蓪蕑薖藂蚢蝤裵褀觧觳諼踅踶蹜蹯躦轇逓逭鈡鉥鉮銊鋠錂錆鍮铹镘閿阽隂鞄頀頙頣顚颷飠餈餳饎駞騆騜鬛魆鰉麫齙⻍ㆨ㙾㜺㝘㬇㭿㵾㶇㺹㼅䘗亁俒俢俧倰偒偡僦刂劦卩厎厴唰啐嗙嗳囀坜塣塸墣夑奰奲妵娖媸嬾孶宷崳嵨嶰幬弅徃怫惛惢憮戠揠摐敾昢晥曎枎枔枠枻桭棌楈楑槀槫槴樒檇檖欆氊氻涭淜渇湶溡潣澅瀜烕焲煔狖狦獮獯玜玿琩瑇瑘璯瓑疬瘖瘣眏睭砢碞礌礜礿禃禝秾穐穜窶竂箆箙箚箠粬糹繈纩缱缳罉羢耈肐肹脋腚舋芶苝莭葝蒆蒧蔸";
    string u12288=u8"　";
    string sourceHan=u8"。之　不以而人有一其也為者曰子於大十、所是中三無二上下此如天得可自事日生則行王在四年至公道五故言時知書與月出又山用文「的何相亦見後心」能明然法來名未水方使州今皆百地若太國南官我及于入六成矣正作已君去將非本謂分家臣等諸同夫乃多安先前世民東軍當西小士云令第即或定主長兵外八從必七治金復九帝門平白和風萬欲學元陽命城服千朝意禮因乎數了理經神通部重氏師身司北各清》《立史聞石處物馬義宗死合江古取歸說常字里食他善起少春縣内初進氣都居過武詩为黄足應兩卷政餘間河雲守尚府周實利便既問傳老海雖遂樂全加受吾宜制流聖甚位惟光皇功度花李始力漢要焉秋色思右盡聲張請易寒且好女性左病父目由次著發佛侯開求祖德酒觀高新志空真深止還化難爾后玉陳口節解草路情稱信到集條舉論親林更直往气失夜火就興无章凡手耳修任齊建龍教語木仁半奏母切首致青議異香猶土散面頭豈莫原望近奉京御益衣向終郎孫郡宋徳田賢置侍髙每夏坐敢罪屬舊唐詔代廣弟華獨卒告久封工改固殺爲動雨哉但交並引嘗遣彼管反保血表記共對錢尊精再辭客勝回才變堂劉卿羅留末依具指降極宣許只伯省忠两吏體院那除圖国按承隨晉形賊痛容這逺會则拜施比眾兒象臨注甲秦車川陵看孝期喜虚惡賜微提盛持收苦你亂業貴俱存升計热余個飛內被落别聽经執特伏衆離號似良戰照報考永類果布滿汝宫予景載廟兼智徒星備室庫轉總幾待当殿授須界送楚登鄉職音退念恩己識丹視菩斯发靈隂祭根疾急甘福邪鄭設察疑列典亡时破藏某仲種遇孔美邊朱品梁魏敬刺㑹住蓋来阿寧篇愛皮申恐吳息丁連誠衛刑兮薩養率領姓儀阳胡疏趙并濟輕楊舍遺願走督害吉歌克順味仙湖素給造遷兄丸飲曲赤監笑将獻推免乾婦附員臺冬商差寺干钱僧説尺量歲斷營廷樹仍畫權嵗器乘攻寶參幸誰嘉忽黃感最昔運賦關召呼葉阴達鎮俗放威竹脉牛撫私野悉句应延銀厚嚴妻務端別律顧沙昭条傷序釋泉市罷勢覺越禁案风謀讀汤波犯徐敗陰温接藥謝遊骨会遠防浮逆寸康示宮窮結慶例移勞紀英憂調紅昌尋夷想曾药騎虎魯耶戒陛辛科庶雪積眼支補丞毒絶夢宿程患与燕房庭據邑门妙追愈孟帶征肉崇委腹实紫男魚尤廢繼射統休辰伐叔滅友供納樓冠祀业富博儒題社獲細選见密淨曹舟把副境澤羣关約消試孤湯欽救角校溪閣盖驚早米筆資刻松』適『熱擊谷韓幽效薄露汗竟機淮朕掌蘇源勿忘船怒枝虛鼓步亭賞咸充恭池桂役丘户答尉裏折簡垂投詞迎乞丈榮唯殊累聚证謹畢略雄顯爵習帥属雅摩敵宰格貞候煎增午杜族厥吐假塵巳珠諭闕陸剛处喪强麻塞危乙哀毛勤鳥惠助冷覆虞負貢莊游旗懷熟夕雜季弗鬼仰判务奔狀沒洪詳嗣鳴采胃产诸寄贈撰否规畏愚們动揚衰現烏圍符印弱朔園責漸泰打姑蕭討財洞件活黑羊查質輔棄錄緣招革悲決蘭郭伤稍橋術对壽編舞屋【】籍逐从豐背辨講專井限農台懼堅避卦震斗蜀齋秀隱均进影录佐隆伊規獄参蜜沈班师薦雙慮羽机駕竊梅靜費郊况庚訓翰童僕赴爭数裡复忍仕脾巡姜却洛妄式索維席誅醉閒雷豆奇准般展縱違晚肅祠丙蔡倒述芳誤糧柔黨底勒范慈禍村研勸旦逢懐策證貧曉速洗邦基怨憲配葢審做竒稽短偏吹勇头霜愁祥横屯頗卻賈桃桑计调墨斬过蒼荒話翁減㫖振鳳甫玄險肝鹽歡侵寅衡资肺該寳完决穆旨刀葬履堪歴襲闗肯允付絕戊鼎巴麼循際壁損諫设盜禪佳額蒙材館壬尹惜戶沉鍾屈戎慎荆叫凶襄煙恨暮傅碑含禹饮強壯煩奪項体堯旁渡翠算徵牧借茶开翼奴包暴占遍术賓谓停尼辦哭階録〔厯〕歎个殷詣炒辟些絲錦忌津抵旋希墓脫舜寡补困究盤癸乗署员款寂逸膏倉桓圓说鐵长兹座談尾细韻昏丑殘庸碧遲书麗群片嶺貫烈檢普坤係珍擇问宇顔结賀杖契酉岸料頃扶陷牙享徑續淵曽局宅穴祝靖銘旅巻輿归遵築錫间超育豫廬操馳慧介亥區揮單偶倚盈宴悟孰徙像学優禦禄洲跡抱泥陶盟暗援隔贊紛卜鶴怪訪论吟鴻义裁讓快系拘柳寫茂樞導婆罰戌逃耕寵恒輪秘覽倍醫舌況燈屢漏兆胸乳惑環彌稷護倫众預買災傾卑权啟汁貪弓紹域鼻鹿痰渠盧夀賤毫浙妃瑞荷报雞区軒整徃擬註种雍粉祿静輒肆崔爺懸純趨隠什繫悔戴葛誦焦狂繁酌翻托陣舒寇輩敷憐泣抑苓吕増晝飾側巧柴躬趣綱暑幼慕段烟乆宻值頓豪諱賔束彭妾穀峰审銅俟慰點琴塘卯柱鐘斤亮巖匹万毋腰鮮嗟勉零帛呉淺凝隋叛单謁昧核卧娘拔寛议须戲湿辱缺俊互岳赦满帖熙壇奈董苑随浸遼咎融攝祐寢粟蒲頌突项藩泄閉肾巨藝穿健焚䝉驅擢飯凉请染儿錯戚謙陀紙觸敕俾迷畧难塗潛靡偽恶障厭敏途没齒黎魂蛇番劍場冊责訶煮蕃连阻竭燒厲價哈蕩掩晴遭驗眉爻炙弊排緩簿製薛瞻运蓮症据屏营批旱现畜拒訴獸淫洋浪叢駐激滑稅着愧蠻貨渴矢桐冀準枯奸潤貌禽尸栁朋鄰争賣劫幹僅溫脱徽衞饑捕茯级憶低韋馮叶植敦浩彦滋油传廉肿詠企筋呂訟湘霞練节賴燥迹税变頂輸斜䇿涉鏡協疮渾歷警医匪衝军麥秩㣲胎华標杯衍嗚遽拾誌吃旬澄尽潮䕶罗諡毎淚暇淡泻需唱炎奮欺疆慢殆徴淳旌涼產砂浦磨壞睡擾漫昨崩粗转範晨脩産苗芍枚塔袁採灰记緑茅披藉奠逮蟲财构怎扵亨返类派忙傍虜響戍乏东譬标歟虽探减股呈誓俯削脏寨苟麟篤积猛姚茍护疼佩績樣級閑喻肥橫巢縁夾总陈較蔽姦逼宏帳訖伍漁拂聘俄狄綠徹託悠辯闻蓬冰晦措㸃技这姐濕跪牽腸极燭儉脈蒸许观遥驛寓認擒鳯毁艱測秉脚疎課割戸奚养梧咽胥騰几迦捨弄监鑒距坡㡬恤歳哥鋒灌裕鄙净嫌恃坎冒髮罔吴瓦擁枕圣晏胜劳妹榖膝牢垣租添嶽柏板酬墮瓊弼暫眷玩拿逾卓團映冲声犬郁顏溝彈嫁欣羌促掠創幣祈碎牲妖潔箭歩羞烦抗凌济斂昆执頻液繡岐梵沿傑鄧龙鬱翔飄饒聰筵语踰括祇薨聊姬萨催杏滓宦芝畝隸憑歐混僚釐专涕仇广倦坊仗啼崖譽鸞衙繞办溢擅职聴哲脂菜还捣巾肩伸娶严组彩遁璧熊演眠幕备泛掃併峻狐祗怕嘆織举囚銜裳窺勅囊曠爽霸损拉迴悅鑿酸控競貶异輝妇邉妨喉峯壺緒眀滯亟瘡卫马漕冥央貳喘扇儲潭肠盗霧灸勲播迫毅繩閭叩裂册閩綿宛惱鑑咨戈彰臂鑄臥剂号肌弘溺箇啓孚恥爰龜捐銷雀莽版菊懿墜裴赫億隴髪藻朴誥棲截勘点撥斥誣汪婚簾薑约黒圭茫顛暖攸陜叙独床閱踐譜電褒茲隅鞭罕虧咳状獵汲霍耀替陪狼潰亞叅车隊矜县遙费炮遜醒藍陞濁芩戮俞詐晩统層肢慨潘貝壮寜验劾雁艾确检逹邀轻街舎张绝驕鈔导廵滄杭蓄絳袖称夙红嵩朗牆勾攜換陋达函偉偃膺網霄悦芎舅澗际农冕另募泊邵黜们牡耆黙模複冦萊檀尔謬揖僉爛魔押狗孺纂渭屠線稀领腑额黍俸弦愿齡刊躍远挾伴斛港巽䘮瓜违纔倘庵析拱詢断確络壓离壑氷頒乖堤瘦岁锉质婢囘梗涯窗誘礙宵续膽盏荊划呢枉淑偕睿橘豹遐敘逰惊怠憤壅隻篆吞恕联祚餉嬰痢认淹匿逕誕牀繇漆枳巫识视裘喚耗閏巷飽曆島猪裹禾险軌謨畿韶譏负偈场针寬柄榜握捷坚腫终昇釣姿牌犀屍綏荀饗羲岡壤填徧店椒埋伽槃宝貽胀么价蠶雕匠裝肖织浴乱苔匡眞透籠壘适涇罵亷勵搖银綺礼彊藤彥薪竇縛譯矯瑟綸濤専乐幅虫臯临喬遮禱刃駭檄呕嗜艮腎醋鴈諒弁隙詰毀墳粒魁给喇飭灣弔觉曷躁漠默浚摧聯逝濫乌構搜电緊疇賑旣飢猷盞暢宸嗽汴乍腳架沛觴罚稟輙劇鼠邇絹臭魄鱗掛洽芒鋪攀評肇沐堡鈞旺歇疫賛森邱暉耿袍偷朽鄂灵膈敝叟跋党恣蘆欠樊撤斧圗懲灑紳態陟曜题挺覩沸裔臧爐梓站喝抽醜协姊憚諾湛拳諦扁籌疲疊粥沖樵膚絡緯誼稿瓶捧梨涅弑牒麦尖纳挑售该勁衢阮貯环疗隐沮杀敎棘扣释勃沃淋烧苏边战矩泗蓉寐棺閲盆斑麾陂胆吸幻箋邁懇稻栗竄榆伺麝熈槐糊禅阜犹媚倡坦闊滞遞渐闢棗閻謫畔带蹈脊岩蔣奕涩効拙綴稼枣垢哩輦恢它忿匈顺箕预轄寥姻瀆概慚票澹滴劄棟膳襟戀庾芻膠縮涂腐賁跳僖雉踏侈跟焙挽蹇癡虐謗翳償昊訊渚濬械羸珪仆綬痘誨趕悼濃糾奢抄鬢噶闭航僻峽濡帷筮笙潁祕晋炭遏圃佞俎培冤蠲閔璽萌汾葱隄捉組従选销图貸缘屑鬥剪揭喧佑札误廊孩硬摘芥恵穢禀碩污毗煉樽槍騷丕势輯翟听怯皂潜悵沾暨杞濯劣戾涎菴岂詹胄闔壊猿棠諧莖劒劑虹夭甸宁疋紂睦匕鶯蕪汉睹脓療臘磬蔓鄴怖缓很鄒贖敖掖翩㸔訛扈㕘匀搏恪亲葵埃臾邢衷悶針貼帆邸球岑唇軸涵痹慘脐讚泽芙揆覲胁奶徇蟬誇网簫饌诉笛塊蹤杂腦鼔芦淪亢冶竿詭銳粲株鎖嘯鞍痈驟酣轅煥呵禎瘥跨㳺牟显历閤驍衮紧侮駿儼祁蜂辜爪鵲蛟灭鮑堆廓剎榻馭弩拍宥搗桔婁酋壹遗柯灾僭兴銓璋歛樸狹頑鉤疽鳩隣装姪饋鷹諷渉喀灼縷欵漿醴谿硝皓凖盐隘揺嬌踵擔漳飞碗軟弛吝壳賂镇迄炳夘噫琳愆瑶楷脅濶豕维凍崑黛纎载簷粹瞿籬齎塲瀉鸡荣双羨怡穎邾贵趾纓觧围扎萃髓杵煌奄懋掘俘浓硯訣旧叉琅紗坑试贼评絃恰訂兀曼豁岱冉彬収耐繆繪羈慙蔚巍檜兔漲挂痕綽〉惶〈陌輟熏酷楹邈轍郢券圜詎刚团閨悖庠蝶娥货諌禘擲倪恬邕桀润軫输瑤疟痞黔掾芷譚惕败欄綵贓杳傲估讒竺厄忤蹄编妓膀贍瀛霽熒俠餓鉛闌愍霖惻踈鈎緡梯㝠靣线获继筠麽莒迨担榔兢鬚槩鱼栢寃勑咒䖍滕唾骸堰竝胞秒寮郵徊湏嘔茹潞餐刪繹贤釵攘蹟昂恍乡緝熬窟灘孕帽勳衫繕湧鐸剥蘿奎鉅卽藜栽努翊軾烹堵逋凱迭輅賄牘芬芽鬻餅臉頤雌肘墻廩乂䟽貲廳駁驢剖麓儻㓜閘撲茱闈迅铁糴爱吁甞臟綜咱㧞树撒懈妝睛熾胱彖萸痒奥鵠冢嫡烂墟皎斟迂斃套臻媒蒿闷娑粮坏渺稚汙孽鞠孙栀廻絮恁咐妥插頸婉彪濮謚畆賚洩軀祔蟠鉞羡釁蠱渙拯叱蔬疹闇廿炼簪鵬瑾嫂琦优逍韜孜鷗匱哪庇鴛歆迥舶瑜凰逵瘀徘聼矧忝庻曩憎撓醇诗轡幢齿讎圆刘濠狩聳牖拓漂响溥肤焰慟咀拆佚扉豎畨殯沂渥濱耨誡殖摇创滌鬬嚮笏痿檻頼尝鴉纸惰繳縫壩悍庄瑪疳迪瑕販兇瑩迟齐鑾卵陝吩蝕㦸勛遑箱璞拏叨寞逞擺滔翦诊浊脑翅甄蟻裙薰详粤蹕敞倭脹债馴苛栖聨鷺纪挈翹覓頴歿曇蚤凋贴恚闡藐寰寿糞苍寤炁皋甕鷄队荅隕耽竅褐棹遶蠡廂黯惇测瘴餌肚藴梢刋攷憫縈纖猜盾鋭刼怀型梦徼袋击冗髻蹙兖侃穹弃吊駒娛蠟溉曳蕙紋稠翕楫苞倖憾斌迤瀟妍臚顾掣寻摹鹹遯鹵洒幄攬伎剝搶矛㫁兌份簇霑熹晁嘴帑葺简薊婿鑲馨棋址驥啖購峙椎璃肱賽剿跌仿囑掉禧䧟鬧潼荘拖鎭拈嫩汀顿迢簽懶辖鬭悄狎胶她习鞏迺腥囂杨暈靄柩嶠酥废诚凄扼㕔琉薇轂駢躋弭欒燎幡寔殃墾墀烝縉纏訥呀俺顶袂覃雒竈尘蘊龔绿箴嚼偿涸葦鸣豬荔羮豚苖債驪溜笞眩挹悸㨗携慷搆瑣蛾瞧捲瀾撞洎匝轮藿拭撮汛盍螺甥鈴嬪蟾仔燃虑虢屨蝗弧购蔵晟阶摄摺噬囉潦泠悴殁萍睢濛媽煞褚碍弥駟迁銖贷读喊恙筑讐胷剌籩鴦貂楓諮盥罹覈鞅溃峨筍釀跑炊渤躡衾寘忧䕫贏沽戢哨瑚邯鉴羙沁奬鍊蔑沫膿斫猗嗔错诵虔稜诃娠氛层帙妣捍霆疝夔勻贄恱涓鏤巒戟鴨槁溟腿话稔淒挫姨毘嫉郝鵝丫汎霏昉窍煨狡譴嵐駝冝样茗祫较敲贯轎宙廡软駙髯燔硃咏郤脯荼毕踞琮拊喫緬慌粘瞽汶辞恆倣緇澆壻灯猥濵癖匣騁畀飬搭蟹磁亳靠穗夺菲彛緘砌账糜臆豔腕茸渝渇涌犢㓂梟䑕咬琰耦詆崙彤譙軰怛藹蓍驃鉢盲恂鋤换找滎冩礪匆矾旄汚莲牝琢昻貿滇犧裨媿勺峭氐蠧卞鈐茵鯨燧雋徂曙黼鯉臍凭懦刷娟让臼僮咫麵佇块泯騐痔鞋頥撃駱沔膜殫蘋丝沼瞋歙紆獎兑窘彚嬉俛篋堕殄揀鄆瘠旭梳柵仞琶訝餞袒谁祉絞閫藁瘞译钟筒浄揣豉抚顓癰諍㢘舂麋楞眇頡赞阼幫淤凛廝廪顆粱卖签彝蔭兰础僵筭拌雩忻啻慣苾蘄澳冐扬蘓殉态罄挟芸翌椿啄廼侧伙残閃琵庖仪䕃挥穷旃甯妊搢杲淄兗厘耻醢纵亿診训鈍穰頰烽闥廖穡腴婺儔楮欢讼綰踊剽埽諳蕤棒愷猴煖昬塟曝圈厨邠兜隰倩錠抹稳伶藪僑燦饭穩佗嘻菱园殻璣蕉岫麒煬鐡鳬浣謾擯酢买珮贫兊糖丐纒栝瀝掇犁鞫痺惹砥繒霓粵艷貺竣频眺趁拟嚩艦頽拄彙叚岷鲜泡醮爹盘鐫塢陆艘抬懽痊脇毓剡龎槎衄殤缴牕丰蛤洮囿鎬咄纍碣鬟榛啰弋雛尅孛瓚䑓漬墩菖刹悌紇旒畦佃㵼瀑嚇盼竦隍寝彻惆罍聿桌窓浹糶軻惚粧摸献砦淩亘徭汰諂贝蓼甜茎甌窩僣卉刮雹鍼毆剩諄励鑰饥榭鎗晶鶻湊繭糟槟尿歉蟄塚邃筛吼様赵棣棍帯雇琛兎订峩摯刁璉窈瘕枢届写菽硫瘧羔篚鸚亏榴蒂浆漾侣欹暂翎闋愕蒜峒莎藕顒廹笠韭緋鬯僥幷圉獅卡盂疵苻舛暝琥楼侑谋騶慾嫗嚕腋祧琪馥柰妒龐盃綾猾籥盎痴旂䘏釘諤絰晃炬绵凜璘嶼贅斡瓢嗎奧嘲媳頁侔忱泮湍触碌皷覿劭縊洹夲窠憍紐洵禆苴騫舖葭鄲麤墉鴟杼侄愴蕊库慝玊颯驤塋噐彗豺廠珊搐瞑谢煑综聾庆憩驂靳悚屐閎簋翘脆讲谨瓘牵弹萼腠噤縹樁画劃褥棱糯慿启廚鬆哺叹阡噪窻亹蝦浅攪軼筐燾勦羹薫洶吒煤瓠蒐淘敛汇澀賠擘紈踴恼斋蠕赐晒狱觶屎瘁佈辩龕叠塹渣晷戯誑僊縻蜡邳匙耒魅歧摶纯蠅躔脘噴惓諛釜趺禋禰穫缩巔駛悬痫蔻纲猝䦨衲馆狠諺愉谈礬寕抛裒吠涿茨琬彷嬴苕裾泪殞畵铜夹爼赭祛璟砍颂翮搬冡鄜犒蚕儕闐澁珂窒謠邏嘶攢窄舫泌摭昶祜嗇嶂彎宪蝎謐磯鄱悽剔砲磊妬磚篩倐怙椽荐燮寖愼䖏謡夸袞滚暄鳖晞朵腊串綢沅嬖玖滛诏訾鵡择簟賭狥湮槖隳舄劔洙昼珀顥罢潯柘俚笔伪旻墅熨膩擎瞳噎瓣漓黠聶蒌羯吧啜籙燼贪棧箸倾晡酈溶恊匏您謳赔蒞嵬螭劈覬佯坂梔丧扯擦囬掲豳儆笄蠢朶瑛幟暹宽泚盪濂鑽慄牋辅夥搔仄磐傭驾憔簮彞螢潢蔥擴玲珥鏘潺虗胤媵夬貟璫淸隧塾芋兽繋覔饼鼈錮儂閬嶷楨宼肋睨捌綃弇鼇煦舘忒欬祸莘躅醪櫻滂氊啞闲〓溯澶菁萎儘㪚瓷肄逡晤暘呆戕鶉桞衿懌屡杉郷矿髀瑰紊颜靴畱亶檐譖逓萄駑贸捻礦玠睽涪堦頊玷遘晕杪籟訃廸漱璜庙缽斾姥髦逄錐艇愬芮誚嵇麸凢袤昱赋压耜閶篁沥蹶闍閽輻餒疥沱漣麴畋谛词亚篡蹊晓覘顷瀕棚姒滾呌萇枷氓喙劝剧貎泳屹偵撻枸詁侶瞞餽瞰緦箔榦鎧燬峴縑菑秣蚩蒺瘳縞敌揉汞瑗紱翫蹲炯攔筹滁瓏笥秽幘幃羚陲彫仅币驻拨储蒯櫛笳擕缔癘偹吻廨胙禿耄葩赠雎纛肴踝汨杰颺绕簒疔觚頹臬粳繚芹奭访潑翺询隗逈錡輜諜覇讨煜膂椅鰥巵鑠緜踪緞剃迸虬菟扩猖醬抃崧朂橐洁詡坠旰窕沆篷訐刈謔紓萋阅黷顙挨卸磧艶㤗薤鳶曦耘槽颇樗廕仓圻葆怏鏗抓凈笋賡犂齧鉉鲁阁蹉詮炷嚐䟦扑扃幔勣蚊汜愜禳肃爆愔秤骑径櫃瀘鸟涖夠頷淇眸櫟鎔闖粪棉悞閟窃钩剋莆驩茴岌甑蛙捫曄讜詈萱莪彿呪閹瓌屆証綂鈿遒钵逗裊癢瑯瑄袴疡贛哄扰脛鵑顗拋輛昴盱沓墊狸孥嘏賫瑀棊祟躲祼殽郑撼够苡菌飼厓剉紘桶慵逖擠扆掀宾捶犍孳舁峪澧襪轟纷袭觔劵鶚稹懾姤阙燄譎叡惲惴穌駮駸灶柬陕騖糠厦颈蘂懺羆珣灋籲莱饱讞鱉杓厰鍋蛎譁爨聋黻瞬獠倅斐湜磔趂輓俶蘚橈磴蜕璠莢餼芟夤薏艺襃宕圎凤埀誹渗贺佔挛瀚龟酪琨溲厌蛛扮锡驱詫禺虺鍔谵蜃攣綦赖啦饉蘸眚嗤奐遴葫慳詵儷倏紺娣擣辄盒畤磕櫓縠絜碾苐蚌惧貓蓑紿嘛秪驄帕戏慤壝鼐賻挿昵礫沌週閼塌丟鵞瓤悛迓惺毬糓逅竞琊紜翡喟嶸扞唵欝漉芾莞搅肛褰塑煽菀瘟卢濓霹罩靑邂曵湫騏揲聆腮淆滸诣淅笈兕騾跛匯葡彧燠彘奖贡憊赏桥缶檣洫煒甃嵌阪昕氈葶簧厠隼秃悃薜紮瘵猫辈澈圮戡蔗㒺奩觜搽蕴騙懊㭍蜚莅爍瘰漪腔䨇紵遄翛描㕮鉏澡卭礮纘杷璇緲荡瑋鬛缸轨祺穉裸締腻髣衽茄崛趋㤀砧擄堞菰韵蘖晰渊瑁鬲髭邮镜娱翥遨谕帮罐侂脣攤濳抉譲詬贞捏缚醯衂髴烘嫋拥泝埒淬唤黥吿軋廐恠誄匮筌膾媼噉诀芭绍鎻陘览掬柿陬拽劬圯覧羿銑襦爬粢蟒稗縶殂蠹锦斵呻朞嶇攫驶殮鑪簠鄞楯渔諶淞孑閥楸玕痩讖儁拐璿跣鐙鏞牴牓颠卹鋸鷙楝溼豢皁桷绩菹鄢婴鄖丽濺殱阯楠曬邨溷疸聪蚓阵畎珙馘絢尙褊黏绞猺泔㝷蝉朮椀釡絺梭蹴飈偪罇胝荻艽沴阇炫痼珞殼翬詘鯁伉剑啊揜腾湣删詛弈敇壟枇痉㡌莭鬰蛊籖纁剰斁蘧郛溧匾黽讫酤厂疚鑊逶炤榷陡荑舸顰玻攄媾奨鼉纠㢲睂郴碉晌穏鱸柑儋摊聫蛻厮傘帚槊竪娃阨梏葳虏褫叄坛耍艸韩刳郗凑襯怵郯鄫淖绳课壕巘懃壠辆毳汽鯀窪裟鳧洊坼哦撩麄袈霰蹂跎曺潄絀枪档圏畅虱鎰鰲练蓝溏㽔屣竽罅衔掄伦燿靂炽昃颊斩嘿叁琚邻鬘垓觥麈玳蓴徠蹋飱蛩膊搦娯㟁岭瞭躇蒡抒紬囷羇愠睫覊讙両慊憧霈汭桴徨饔躊欷坪郞螫瘤驰僱蜿楂緫蟆炉紡蜒筏朦鉦酹縦繄胫嬾鹤痧哕遡娼琯孱辣陁啾罟苧鶩箏跂滙禇籀鷓倨殲澮匐讌湾佺蔟缠媛漚隈嗷厉簞酺纊貍矮䜟冺壙撿戱疰癫禕髠鏃珩诺歹钦聮宄蒋弒繅兾岀洺隶噲飴剏夣諉愽騮媪哇瀨瞎蓐睇姝軺鉗皺箠襖秫惋籓羃癃肓羗蚀僞撐犖螻撾倆嚷嘘紏飫塜嗑崎扳氤䜛堙籃㳂贱冪茆鴣祓篙蚣蝴冽贑衇虵賾揩谬訕黿憒錘槨謇鐃厅搴湟躭豸捜缾刎甦菉攅櫂縝沟杆铅褻颼萆灤鈕慇藭狽醖捺頫蜈帐戛祲糗皿昙鍵鋼芫纹吽殛奋洄筦鵷眙芡槌撇蝸魴隷芰跗怜螽摛筯㠶瀦賃湄浑薈攙扫挖籤茋貉狃賒抢嵯丛蕚甬砭藺矚唸艰雝靚㓕枋暎譟崗綻徤衎覷爇匍渍碁鏐旛鼙锅塤㓙倜姆捆猩掺亙睠佟贮嚳滲纜叵萧螟圾垠嚥竢荏襍濩灞侖釗绢屛递顽㳟緻廁冑喑璨擂晳蹌顚廛儐雯瓔瑱戩鴆鮫湲坫痂氲㬰佾蔞茰荃罽苁冏嘈賖珉輈腆扛哂熄侗鎛埤皖秧伟嘖岛圩垃磋聒暠饰哽崢懂滬麫鴿卬檝锐癎禫鑣棐葷矗嬋柝甓貊虯馱忡暌鄔礎悰冨眄伋縳臏獺宓巉柚郃嵓厝僦笻薔蛔惨堠嘍棃穠裼茜倬滥瞥鑼町僂扄胖灝㤙瘼饕牂鵰凟貔邐朧膻坻廈譌瓮熲嗌孀鸛谒鐺飡拷曛鯤汧嗅郅蕖巋撑渦窖娜瀰骤䙝薺码矍苒冻詒彀塩氵怔韞唧秖絆埭讯烙痍秬韙飜惘澣臓㝢哆娉仝婬埠濇駘癣臠褲竖邛桎幙忉悒盔菘蕘鉶踣忖撝蕨锁墙蛋奘忆滹㯽躑蛸噓臀徉顱菅蔕刖鏑洧簸霤㐮歔瑙荚鄯兠赧覯緹拇遹亾践矦忏擋焯畹凹辽炕霾躐歪鞞淙曖祢袪鍛諏皥櫬饶蹔蟀㕓苈暐槳搨餙睜輾斿皈釧憇壚澠哮擱筴饲窣澎酆樑櫳蜘窶飧庐檳胭鴞樟偁瀋媯鍳罡喃懵鷲鞮茀唳昺珏跖緼縢讃揄怫瑊蟋縟圄诛滉噦蒹劓襁輳撚嶧帅窆蒨鷁珽瘍勰囀禊碰繙颁蹻锋槿澍雾抖廄璩皤賺滤頺谦堊猨蘩霎眥峡葑蔀橙轩汩炸玫岔膨缝甍莠楣萝殪璀昀惩鄣朐殳狙藎忭嚙躓麯莓拗閙烛踢鏢櫝踟値栴吮綘喈蔔舆砒柟靨碭獗仭䋲嚏緱盅匄彜桿睺闚譔浥捄焜紉緗骂幌銃枵皴澇勋狭嘱鬪荇䧏絨埶嶮龄擷誉鷂磾毖掊骗瓉轆鸿髫〇逭蜩畬籜駞艙狷烜贇剗堇摠齪挪糸㐫柞扭罨鍰篠畚嫣蠣茭罌窅苫褓窯铺繖蓽郄耋刄厪鼂賸礴煇袵溱縵邴鹅闽鏁蠆聃崆擿帔醺綁拚辠蒔趍鍤郕謟璵鱠謄谘咤淀鏜柢磷莧畛櫺姙豊怍訢瞪鄕勖螯鮪欤嘩㨿埵芃邙鯢塍琇睥跃㸑癲犇芊妤淛霅椹怱邓鸝谥黝尻芜硼铃闞囹笃叮瀹濼埏榕瞀欧眡瘢刲埸佉怳牐陴騂燉赶慼繢纚擐豨歘坰岗婪冯羶筝祏荳芤陔糝杌鄠檗辑俳嚢擡壼薙偓玘癭薯賵螵鮒㺯诈掎讳辉粕枲邽帘徜盻虀諗揷淦蘗佥贾繽涔泱甿嚶涘穂貰榼獷茁棨虾绪赁旐膴湎阎櫜猊咯頎齟齬夐駰蘅刦喋摻蝨薷蛭縂栩綉朅虡蚯勗衘艤擧棼祊艫舵闓磅呷诬泓愎畸揵帨絛醍驊媧薌蹰啥栻腓髩儞甎扐謖键絪綈蕋暾綍罘昜穽璁玦坍鞶栅蜍朩蕞郟庥蝟頋諲箐譛礱賙廏䏻呃驁鑱鏖啐綆縋挲輞瀧碓唆鞬谟猱浜寗棕抜熖皦酲厎驀熠癥蜺僃湔庀錙谤磵悝鵒檠濰鈇椁柷澌醅矟撈聦卮諠魑傚瘙洸覦隤慍铭痾芨嫠濾榱鳞斲錚诱縗嫖濆飇狁埜喁挐掙湼蹬郇蜉㠯〗僇槀袱褂挍涤饵侠〖勍竑攖琼驮鸎璆隲绘糕䆒觅翱惭餗軿掷嬈蛆摽啇跼埴拣臞拴閈騭贿凸瑭荟䂓蝥蓊扺螂郜憸侏咈綫顫僨菓愀蓿苜跏橛蕡攏馀盌崤懣靥庳嫦宠胯傴嬸儗舡樾揑喏畯聵髏驴褘瀼褁癩肻憨驳旆泐筩朏朓琿牾枹篾澂焞旷蓂饜箜篌龠寀犄敔頏燋窥绛熔罏瘖轤辮澱拼佶紼窜掞溽臊谏阔衒嶓杠卅坳颻馗憮巅螈渟茇鱣錬鑚剜凿糲誐哑謊坌婷廆禴餳瘅谐斚唁暱埔搓竚篝簀璹緌湓猎纉佻疴掐瘋尧頲婕鞘襚烁页闉髑簣䛕窳蓀亻墠烱耤縀恋愾騑笼昩疣酿癯㢤蓯菡倀勔菔唬骇麁軹龈秔遝岧澥梃肫癬蚡鶡屁禩塡醐喂獐靦摟劲旟鸭洳䭾跬恫颗嫻巩跷柁鞾螳萑蜻棫矇箬闘鮓㷀哎櫪蹀矻骼沬膓炅獮翀蟇阖氅綝翣咺釃疠纈䰟啗廞诞鼗轢钞蛀韦蠭飆氾葅渫婣憬橄賕嶙褶巗詧扌稾樛郿阐䆳瀏鄩篪鍚飘紕茘嗾藂瓴躪娩呜锻惬餕燹芑碟箧崦酎髡煢惯獬饘嚚愤瑒靺伾颐桅爕皝頵颶戔踉畊轝囟郾柒殍徯碼橡檔赛蛮吭尒箎銛沭凳鏹髽窬諼毙磽淝鞨獰鸠槧汐噜壖贩癉蠖匭嚬懟硤沍盩穣沚鬍筥嶲徬綯鯽栏酧玆噙戇䄂殭饿蠍犴撙捋廙綣壌蜓鏊漯瞍肸鸇邜忮繾醞痨恧旡㾗嚭檮瘾哷曈绣虻襆撕阱癞斸咥莾褭悮蔲鴇铢莩簴邅椰枰嶤鵶嚌淥纽鷰讹糅僰傀卨旴獼袠沄濞罣噍傕罥饷跽讋钓噩衕鷃厔嘵捽幰繻鹊亁瀣糺誾禖眎涙羝暵幞舳㓗黌鲤嵎焕哼氳爷俏嫚躯卣呱趯谅酱罸蘼戳窑郈鍪煆峋鍇愦憙蕆嶔鄄罝忄搥鼾疢蛄詖缪躺簌镑鄘禜蔹侦巂藟闤淼韁傉颔飪孌瘿詿蜮韃饅儺鬂囤閴閾鷦獞羁檟鍜戞溈舷幬荫垍渌濊崕廱鏟鷖篦窿诘齗藶蝠醑襜鞦吵輭々壶贻桁帟瀍咿髒渰欖丱蛺喲蜴譫臑呦頠輶銚鋟蠃楔粃肪灔嫵瑠瘫㽞廽捃纤刓嶄灃惸峥酳塏拮荽蓺乔棻礟蹐蹠亰琖瓛縲謩剴磻敺妆鋌妲鸾枌蓟詼鵾貅弢飮鋏訏倔呶璚迕剸郫僎瞒迈嶢摳穸嫓慥虓㪷尓鷟瀬脰晻䧺斆溘閡蚋捱虩揪鬓齕栱紞芘餮鐲麕渎傒倕吶稊韡鴒琱骰阬捩楛瞶亩綌㝡窰鸂齷汔蓁疖袷佽窦韈摰蜣姮贐濘硎躥荄啣黧赳鐶挼潏硕咋贲邰悻焮蝣垤眈侨揔觳鄊魋澨尫暍嵒楙罾酖泖蝮闠蒍逛褪㩦荜驎檉隩讟衚鈆璐紲钜㳙薳觱隮驿吨柤䓁餚酴窝媮滨鋋漭斕嗄熳虖轔顇捎萏匃韠鸦娓惫擗酩懒恡儡扒麞惔苇苣粼霪黟耉耑麪侁罃坟鞕嵋厫鎚歃邶倌傻嗛愨酗俭獪舐蟊鉄玁蛉瞢祷颸涣蕎崒眦鵜钻颷姹磑阝洱邲锭鼯箍豌偎愒涴羑矰餬胚矫拶鸜娇闹惮俐棖癧蜷瑑綮舩璪垒搞趟闪韎畮賬醲褎匜錞劘憺毯滏嫄蹷黶咆餔摔稲笮蜥鞵咷睚謎㕑檇肜蠏曏胛魍幂踧屩螣鋮钝蓖皚莉頳厖蕢㮚垜嬙慱蝙踽酊醵浯亊鋩魃嘒唄儈喷軛臙锺秸眵釭宂唎茒噱甡諴敭饞饴蕈泆枻麇筲鬐龢雊喆啮艳鱷唘逌嗃柅騃絙麩桄殑覡曀诠饟洟盬窀刍舀潸掏曁囓瞠醤鷯噀牁娄璡縐裛姣憝獒鹺鴂鼽㩁摆桮缕诫鰕朘螘醆苹襴礁瘝樺煠儵鸕胾铸牎谱秭颭䘚涧醻洼踔䑛忪颅趲枿芼渢楩韆媸眊赬靼咧䓻茉岵鋐㛰殴澒鬃恳爚钗仡塼捞酇醎諝髹洿箝眶鋹颧傖秕䜿浼遛逊籞蕕鍍児绅钉鬴悱饁韉禑幪赍沧䜴蓆贗犨軔硜樅䖝呬脗屧沦蓏禔仑罳庞慆藳剄朒輴劌鵩殒尠蟣敍欻茺岢稂頔醿祯乩篔歊灕絫酅陇騅怦鐔菼㡳涛痙鈺痪闑鷩荥眂羖魘餧芪迩攒甗阽囗韐駉壎惛狖轓耰攽框禡槲砢貙脤泬痤腧坯彳斝嵊楗嘅雱叭鄗倂暁迯躄绮冈䞇襠淶唶縧澘嚀崐懴蒱蚪踖鏌煅衅闸浞焱珝瓈嗢滻蝀涑銍悁脸襞钢偲毉篥褾傢峝簉鎡鉷甆砖閧攛垛愊睒魎鶬齏筞㮣悤沇楅絇牷稌顦靛溍喔烖旎毿洑庋蘢爝鞚埓姫佘漑脖蹭鼷灩餱婀欎苋纬迍㦯搠婭䲭啁鬷訁圳糢嚨疉塈耼仵嬤胼咙玭泲剞糈絁縕閦懍麑槱皞綖轘儇懨瘻喎礿蠙痱緄卤櫨菏赎囁谴栋灧蠁俵漷脬駔輊隃嘹挠闰莵刅翾茝裵婼廑栲瘈疯缀竁崟珅氂妳蓰诤忸蠒慴敉俨呑廋漙劂璮蒭螬凂枘鈸瓿脞鑛㗖俑闾佣巇舠谭朢鰌㶚泫尢嶒杻麛癱銕飣騄硏舲杙榘翃豋笨絅俅樱鼃昪耎馈胳戅逥鬣鈒蛰讥倥咕濒騤妺畴繰摐媺旖丢璲咮莹鶱牣翽蚁呐漶㫤嶋瀲簹雘湃癒韝嘽柜晙澦辐鲍鐮閠倮抔簏髤枫狻诲婇汊緍輹涨崚繐骄鷀瓞靁勩澼葙酡剁獫禠蜋鐍厕睎腯臝闃櫚沩汸缉觿赂羼鹰洌轴孃鄶柶玨觖衤铫鸑膛鶺饬絏鼕抝禬纱裀鍠鍬澔讵鹏绥罋唫荠趄躞蹺齦卲凊嚅妗袐纶薢赘钅刧唼鑕笱詗骚鯖鷥滃屺晢漈诰埂濙辍廌熺篲吗皜盭莨謌橰臈璎睟恝幀赃闒颖齔坝爌磺筓皱谣垦絓躚軄淯聂鷇衺噭謦咻祅佼穟绶馹頞鳲劎嶪䍐狴閿悕趫鰓牯犛睑躒鑷顴獍訌齍睾眯箆贋芣麰崿恟珦誶靶颓泇唉幇瘲砰劚溆赡蝌晬揽蕷讷媟湑赢嘷殢篴闺胔蠋饎崞洚膋擻尭诳崈圊嶰蕾赌垞糁釂惙燐畞裯痏聱姢鄼巹弯憯穜觝吆滩墖醃娵曨珎萹簨锥阑姍軏邹鎌鴝甒臛蜑霣诡囏耔鷸艋鰍茈韍藋帀籐彄毌筱萁颿憖箒浃嗬殚泼蘺杕熛扱笴糵鏈訇辙鄮珤懔凴妁薝蜨暕灂炰贔疙踦酏譊伷姧宷泅妯岏蕐漊礻籧鎩駃齮唏懮悯晖棰歜襌軷鯈耙蓦琤讽箑莺欃蜎韌鲫蓣褧㬥㶑皛蝇怅慫搤吓窞㳫咲蒴棓狮癮鵓歠琐豗倧橦蜼蚍谊搘贬帜癇菇尨昫矞詶嘎狺蔌烊粽癤䬃騧湆煕蔴澜牿皪偘贰戬紥釅恇躕咍塿蜗佀墁褕篳梆汕篱靉铎嗳綎氍瑇簜薿麀幛犭驌骯呴唔坱敧鳷鞌醁笺籕醸陿幨橚逑硇蠐竆甖鐇燁媢爟熇蚘踱斮玢佖谪蚶楶霉柙耸鍮喤蝻惎皙嵸珵浇関咂揶鱖帡柂灊痠礲纆檎蜆賨睞橅砮蚺赩凯迮捭篘藓缮扔窋俁沗鰻瘐荧鮎矱磈摵痣拦泂睪葯醨鮐柎娌戣瀁蹢肹頖鱔獃饣蝝倓搯斎抟孶桉氧漩铛赈雰縚釆扪眴紃瀠繯蕲跚姞痓舋㫄蕺嗒椑菪蜊骥搃礞嶁惒絍轕罂脀垫垕燝隹僩碏讬鞉呰撅蝤饧骫勱讁幗摴跕堨傔貤惝忞缅逻玅癜惄爓謭剮㨂嚲猓戹啸璈笆鱄旉毡糙籮胪猢蟪荤鄺賍銼驭钧芁蔦雑蹁衊纇恸濈臡姱䕷戺輗卄欿諟椘糒膰䌫轸攞敻枭乜昝稈誆禭屙籽虙齠踹賅饍棵礧咚噯枓皐縯巃薅榨犊菆鼒屿泾缢鎪簦襮軨痟繘觐嵫搪楬鐐伻妮柈沲椶疃砸攴滷搒牺獯揠簍禨炖茧蹏瘩蟜皃鷴堧峘欸鬨碇蒻噏瞖绑薾靷褖胠梲棁砑瞅褌颤崘鶼鵁繶锤嬛汹瓖鱟鸳咦湢抨漼蚧勷螗㰱窨螃踘㯶郪屭岚跱鶖壍龚墐盝㴱篨窊嗥昞鏄楪鐧弆悭頍韮缨騕怩珈馔肭螿㝛绎胏掦桩罙谩邗桯玃玺璝暦憗湇湩糚蕝勌瘉嘐戽晾齲抆眭繈舴埳缙蹯椓薁跧抶譸驹驼巿惣窌苎蠓麹儛悋樷矼诜䖟駹広梹慓猻艎蝱衹踶鶄嶴浡郳骏呿虒锯隟鶗珧棬幵擥爸艹嫺窽妪挤毹箾䍦憕蚳紒麂僝岣忼鰒縡鵪谗逯筇㦲钤愓旍齓嶻闼鬒鮭彴苢魈睆穪瞤讝缁酵慺瑉擭㲄傥崱彯豶黮噢舰鍧鳌厢辕煴璅轇鲠鵂岊愞鎊驯鶒漵袝鷫媫踆恻犫觞觫链诽咩葚骭翿倶檿穄箙肵訿嵳绰袜㘭岨鸯厩姸鞲閌蚱豻飀馁坷癆霙㐲牸総刨縿萦蛹㶁燻稭穵槓稑蚨谶辇旜梱遅劻羕颡榧籹圬媲痃睬蜾躧麃橑獭钁䍧仳弖蚰擩簑腌脢鱧㬋呛铨餑欞鼖痡嬗潾睍騋䢴毐鼛犆丨嵂抳迳僶茌鞀訒薹斨甽飰郸䔩徕臲豭闵砉筤噁茷賮圞袛帬鞓鼫晧涬諐雚汋琲碕紝奫渲碳韬僾鱓桕稡镞悆椉肎噥垄玑鰐猋阀餵憀玛擰熯幺霁觕頟愫歈猒臌箫祆螮嚧鸽畺駼嫫碪駈麏黈鼏俜忳襈櫽艨谆罈橢璊瘓駵龛伃喩攲籛菶雠仃嗸鼬㩀籯茢埧鬖偬噹敓筰騣蟈娀怊觽亓僴刂渼迆珌蘤陨哢嵲瑴瞷鱮蘀騘嘬耇钳笭趼鞔抺緤耬莬蜞豝鄚槥裱鵙劖霂跸鄀鯫岍猘篸槅蝼頬魇荈㗋嫪湝邺騊飨啷焼荗赀偫嘑缆鉆傜栰眢鍭経謏胗褉覉醽廒艟譍蓓醳曡碱觑殣嚻殡沕劊灉狶瑨晼栳浟蓞鹻匽韲䳌啬襤坵鮀鯿鶂摉攆鯊剙踅餈冇湥莂谄邡阸霶畇繃蚖埼潨痎鍥佹巑麌仟栘绸轿㲲儌堽眨艴㫋龡噠搉旼泒趦酃骷磲醓伫埕挡玼谙艣鸘齣鉸瑳袗赉轰舱苽鶵曕芄葸嗁堀琫钺諢蹑蹣劼狨駡瞼薮湞焄痁磝縴耡柸矬縓餖髟奡蟫蠛餻歕荞陥鵻攵甪脽蠔钥闱鈀剷卼夯袿鐩韔頄堉緅伞凃殀澉㴻晊栟綑袚彍撟菸袽笲綳喣囈挻瀵窱瞌龋偌憹煚猙帢燖蘘貜蓧銮铄霡疤蕓誖鴽櫩颙輀砚蝘鶹冔箘烺颍搊簭滈滫踯㹠偻窴淰赣㢮秈韣祻槛樝绀鰣凾妈宀鈹餡驘秠讶㙮厙淟鏵鮚溴鬵侘懥圠歗覼旤唃堲笫噂礽絝纑䴡磎譓呫枒嚣荸鞗傞璥恿鹦跫臕踠弨谚隖齁槭诒囅紾螾贜霔峕庿躱靸傃儦燀疱筈锢沪蔯逷飩饈圅掯珫褵轗頦姁杅栒绯裋餛骳汍蔷裌牍噸烬鄅鄏靆堋戧癹罛蔫蔼儳谺輮辔壷缄谧酽㬉悳槪礜脡髅齑圑鐻镂棜簳藷虣鏦餤瓯莳鰋䦧旽澐榄煊珰蕳裠褷襢鎸骹齩傺焫頮䓤惷権覅譆鐏丒欑繂豵顕渧銙梠砺錕鞴噗萵遰骋丏毦鼋墦沤訑挝晅瘂雳黹倞碙謷谽腨衬釴骆漻瞩砆阤䔧冓舗閂騠㔻嚦彔揾漘継閆髢蒟咢嗓悊箄芯遫艄讕淠簔阏呾汳灿缯輥韀偰蛑蠨锄筷骈麺怆戻皸鋗恓溵訩廧愣蜇帏櫥篛躃悢窔酝隽靮娭屜綪蚝鑁駴鬮蛴擫淌罻鬩廥溠稺窵䠞漦簁羾鏻䘖柲稃谎扢鑌佷晛琕疐诋剟惽杈桺筸儹禚碔绽㽲祋膞辤愐浰鱨憃牱縭覜軓餂锈鳝蹵匵潬萤鹉攟斈唅屼帗紟䟎撡栭涊澷蟺曅燙酘黁噞巓浿甩胰鑴鹫藨輼辂霫髄喓慬蘹骁僬椏瘭緐裦䟱侫喳皰谍鄟馺鼜褸镕冣盹踡凫怗樨湋觌鬳㴠癍骠匳毂眘醊䀌䕡冱媕慠泜碻驦捡搰罶呸檯篮膑麨枅栿瘃綹蕣鞿査猕穨籋粻捴疈蘞兪昳槔稞薶鹭齶嚎箓蒢闟鱒瘇訹踩輬釦嘮堑苶顋鸱䴥匊愳煟聻佪栾赚輤麐䌓秆緖纭蹩驸埆耏葽駜崪晜餫吱哚垸惦跅鱐鹄涒灺珓彠傋塪墄郍阗儧牠処螄嗉滆襏啕狒磥纡薖佰瘛崽殇甔痌綷鬅㚟嬲璺墝宧歼滮莋蚿厶琹涝皭吚嫰礶缷蒓裲趵楽滀膘悾榿蛬剕胕髲剚検罭鱻嶭慁瀺蛣撏溳潇瀡莛鮦俦啚椷洴纥葍㟧亵懆琏脍臮螉霳弣敳椇熸膕雏鼪齅嫜熥駪屇撬瑫箵嗈笪譾惏拕揎朿艑踳畟菠鏽岈榾砾窾髎鶘儤茟餁嘸縆跢傪姉瑺穑萟鰾弰暅璂逴叀堩菝葠郚饯鸊宐玟绊臃褙騍埿胊薉摈稏跻鋈哿捂犮痗瘏縰胻蔺镬髃壄蚬靃㽦忬揫荂袓亍倢檥瀌纟堈攧滍犵絻荍蜯铠闯阃帊韤㪺啘崍挣蕰撢眤臿謅鏇髆鶿螞蟉陊飒匼哧掔蟛襫鈃丗俌棅琁硉镶坞眹纺裓鞹曶櫧煗碶馵鵕榑骊囦墯蟯䘌侥噣墼嫔裎豓軆鳸籝鄤匶喽鈷鞂瘸蹡髳堌屝牗皡脁奂唰撘朙榈涗菂觩驷僛掳韘宬晹烤疒蓱铖騩鰭闆㕥㴐䡖壈菻蝓袅袨刵煃砩禝纣㝎刜朌鄃塽醼鶏侲圌摑琠蓨坨苨檛浔簵颃鶤鷮伛卍嚫曮羜撣柮濉灮琭瑲鲸龑俔玗苯鄑鄷鹃䃭嚞猰薧鏨槮祴觇㲈兟垝氄蝃裰轧镌颏黴咭珑畷蓘蹜鋝玈硨篹蔇禵薍赊趑鬈鸩慂慑玹跲轑迃錨㿗嗆昈毚彡摒旹蓷釒驔勠嫳飂哱嬀㒒㠝揃㴞肈峦嶕痬翏舔蔆蚑䐜嚓椗櫸鄬䨴曚柹辵䥴訔犉閗鸒㕍晸炀唷挚梴贒霿淊诮骩氎荛蜢鬌刌枑絿邘閷幦淂稉笵萯塒墪肣艅芈桢橇缎袢讇趴楳秊缟貆颱啡堝媍敶斄榰泞硠飃鹘啑撦獾筳纨阕鞻骡垾昰萐揕摜滱瑢綟褏趐梐鼍卩卺杇獘裩跺鬄啅孿璙纮蔾衖岝箚谑猬蓻䆉栓榎禂艚蘑轊鰈寠惵泑薆谼涟腒莝襶騵囫娬禼鑨晣篐臁鑮㠘噰挞芴坩庛桧潚焴绒邿鮆鶠㫺鋄颛飊屮枤翯蠼鱅娆峤瘗缗裤徔忺沜湨髖歂毸瓒畣禛谯颰嬃嬝褦㚄啪懅拲杶枮爿鎁䵟椸洭涷耴蒩諓軃鑞陻颦鰷丌冘噌愻铲筧臒葹髁唪矶祍秅胹诿靧㥄憋攥洏浒淜昷毰犗繦腷虆鯪鳦扦磣襕轜傯恺晫煿獧輠圂氶颕餹騸鳗儸墢謼櫑蜱輇輢鹼嵕挏梡猳絣蓚儜懑鄹鬙鴰埰筅罦飥鰱黲䑸嫕旞洨狫膟鱘掫摡禃䥥哗紖镰吷囱扅褡訽霮侉傎栉毺澓狌蠺侪氿蝡㬇䆫壒淈焬谀㴶㻛呔哳崴犠薬貘趠寉檖罼螓辘骧囯镠侬偭涍滳穬躩鏝馑駓塨幠绾艧蝍豇䰅巛潩璸俓畈胍腭嗶奰椐櫱玀菣蔿跤髧㳄殓澑矴蛲蟁褠麚䔍庑扊漰耩腽䘵丿俴嬿荓豷踸驒鬋䓗塉渳遟䦕嬭崄暏椌檾毣滽阂拎搀樠癈籊綀觭賧轼儥啍嫮鷽偝㭬㰖佋畒腢鎣䗶俩嚄奓曌朾鎦帉撱穯绡腵菥霭弸欂砫碯禓髥槫橊癌蹮駄毼稙诧躶悺玎缻舝䄡晔瞫鐓尪嶫朼浤穋踌韇廾慜敫楡礓翶衩迋阉凥涚澚纕鞟櫞烋籴饙斅膢鸪楧詾輂鞙魨鴐㶏䴊挃笯胺讴侜穅蚴骞䏰巙摃撆飶餾墬杗炜缵辗韧鶋抿碞蠵喭揥搁陑雺摝橹甁觹餠䣊卾朄泃诟轶鯔鶊㬌筀鋃閇阹盉蠯邍屦屴炌翂骴鸥崷熿眕墌忷炘粔諑霦颉䗫厞撂泺祤贽錍駬㵎䝿楖牏绫諕躉銶㢸圇姘燂緰芉隥鴥儃拝掆斒椵榥芧赜銎鋬霛鹧凷剺岕澭辎驆嚆妘趎铓骛僄儓怤溔爥盦碘紩袄鷕獝肂藇鍱鷞嗨堮妷溅烫謜彂焠焭牼硌磡粺苪釉㨎惪甾穊膷貛轀铍鯷埇孼実弮杴獖睁紽鍑嚘橜膮䘐偼嚈囝栈欱獳籔觊詄酂韗饃鮌鮞凘岠梈漴緎罫臋袀灄茔霨䰞伝洓甋笇蘉頀嘰濔焘稯罿脔蛳郓铿慽旊硐秇穈緺舃觷铉媞庒湅窸钿䏶睊膁賷鑫卝婞楘発蕒藘観诂阊㮄堁掜桱毨瀫竂羋舢㹀侹噆戭橒淢潝狢琡筊韺幖楦蠜讦侐冫囕抂烷焌矉㢠䢵俪葴衵読諞鄽钏侀帰蔘蟭馒鱺忩怲甝呤埈奁杬祹竜缿葘蚄豜髺鵽捔蒧噔橧乓伈楢蝑觵騢鳔鹳㵸㺄渑漐潟禟羭诩勮慞旝汦穮臐鰩伹厤搧摋櫆欏睘鋙錶槻纻荁騞魫鯶鳏媱旸樏沠灎糍菫辶堄摎盋粞綅羂茬讠锜鵯䁥嘟幐旓杝檡犲襭応燇緉冼匚缥贶佌圁籒饐鹑㬠慅斶瀅瞟砠碨茕裭飦骱乣嗡弅憭脃谮趿鄾鴳齾䙰冞埡硩碡蓛衈醟鱍㖏吪昄狲穧裧銹齘䥫婊幎恌笊胧鎏锣淏疁瘣貐骖鮧仚咡媻屓淲熅覸谹蹛陗驖剳嘓峿桦溓犦筼糇赟頇垩庌懘桒瓻瘨蟶蹦醝雈鵄黩㒟俣垻瞇礌絖茙鑢黾㕙孵挶枏渒秏虸鮨䪥儱嚱桼樕錁暧毾瑽瘑㝏㳅仂俙嘂尃橿蠚襻諰鄵侻咼簰镛鲮拢珷覻轺駅麖湳膇舺詀阍䵄卌磉藾铣鞈夌尞巏槷猲硪谔鋣锍㪍咖挎檦甀礨葒蠮袲譭髋仨刾尬攩涫煓荪趡顖駏骐鸢䄠乒摂濄濋蓲鄸䃮冂櫕狈嗝埝堿朣沘猞璛鉼锵鞳矹礚坋塠帋桋気薋鐄隉鰂黕㠋僔僿咛炱瑮窐艓郙䳺壃胉腶虋螖鄡靬鸐㠗䣛嵽嶃澟萩蚃鯗偸帻廰扤纫薠觡谲轐馛囮睃稬馽鹞尰潗鯇䀮䙀箯膍郱偟嗖庤篿肏螙衜诇躙邋騈鱏鷊亐佬紑苃薟虨镒頩侷僽柣椔焊翜艍蓫鉥䗪䜌䡾変嶐檍礐籺銲鵊麷佁哤榝硾臰蟢釤鮝売嶅庪栎蒗鏚唣瀜玡秺鵀鵃厈囋垔姟揅璬謪鄋黤墺媠懬楀贉軑輁銭鋆錔铀鹗岖旿缣輵娒嵁眛莴蛚駾㱕䂖䄖殗涽郉阆㪅刱嗏赝餺悗欐祎稣苌蝯蠎靫剭圵塴栵珖腄蟨鄳韅齰䔿䚢厹圪墡樿蹹躠轣鞥㭊峱棡滶瑝瓀盯閜飙黳䆗刉戄畼疕纾靽馯丶敚痀粦轲郏餦鶢烕羱谜馡駣嵿泭潴穭竮陾齚刬毱缌缭羵莤蛱轒㲪尷崌轳迾酰鍈餭髿鬉䙫巣旵杮濚碛翆鰉棙樲狉绌蚉蚛镵陼鲛婵満烩獶玞磜詻鉟鉧顈颞驑鬽䂮堃撋氮潎稸籪绂蘷轥鏬靿黅黓捅菭跰楥潠爞瓆绖裆褱郲顢颢鸋㦧䍥娖怿戥楰濜皀茞鴃麅堺嶝掮睏矌绐罴莙蘐豖铝齆ㄈ䀨䄍奼寋梂碜簺觏錧㮮劙挱櫄歅歾汃緵胵艭醥髾㻞䋫嗦姗薻趸鈁鈜䕩剨寪恹戃扠摅昡燫籁贙蹖饀䘲庣棷蔈蛜赓鸃䞉圛撷畾繣肮钮䀋晈暋梜蛞蟳袡辝镫鱭墱妞愖梩橞艌芚葰蠊诔辊辺鏺骾䈥仏俫偯揍澴禈貮逦遌釬鍘騟鷳黂鼊敡晥猧訞醹釱餲䯒厜坭濑竛膄蘝譩讪輣㷔䱉䱜嘌囡屟嶞灨皯籈藚蚵郧扡欓済烓讣蹍鐝倛僤冋堘嵘忐挩撁擉梀欘沏癟虿迻遢餝鷔鸬";

    vector<int> ilangs = {1, 2, 3, 69, 71, 107, 108, 7, 8, 12}; //zone  1 3 4  前七个zone1 后三个 zone 4
//    vector<int> uheads = {0x0080, 0x0100, 0x0180, 0x1E00, 0x2000, 0x3040, 0x30A0, 0x0370, 0x0400, 0x0600};
//    vector<int> utails = {0x00FF, 0x017F, 0x024F, 0x1EFF, 0x206F, 0x309F, 0x30FF, 0x03FF, 0x04FF, 0x06FF};

    vector<int> dheads = {0x01, 0x02, 0x03, 0x05, 0x07, 0x08, 0x09, 0x00, 0x08, 0x10};
    vector<int> dtails = {0x02, 0x03, 0x05, 0x07, 0x08, 0x09, 0xa0, 0x08, 0x10, 0x18};

    vector<int> hans = {103, 104, 105, 106, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 253, 254, 255, 290, 291, 292, 293, 294, 295};

    string hotHanPath = "../data/zhwiki.txt.countHan";
    unordered_map<char32_t , int> han2idx;
    unordered_map<int, char32_t> idx2han;
    Tool(){
        hotHan("",wikiHan);
//        hotHan(hotHanPath,hans);
    }
    ~Tool(){
        printf("~Tool\n");
        heads.clear();tails.clear();alphabetSize.clear();ilangs.clear();dheads.clear();dtails.clear();hans.clear();hotHanPath="";han2idx.clear();idx2han.clear();
    }
    int testTool () {
        clock_t t0=clock();
        string b="哼aâu Tiễn (chữ Hán: 越王勾踐; trị vì 496 T";
        string c=u8"哼âu Tiễn (chữ Hán: 越王勾踐; trị vì 496 T";
//        string inpath="../data/betawikiversity.txt";
        string inpath="../data/test1.txt";
        printf("\n\n  ---load %s  \n",inpath.c_str());
        ifstream fin;
        fin.open(inpath);
        if(fin.fail()){
            printf(" read %s fail \n",inpath.c_str());
            perror(" error! %s  \n");
        }else{
            printf("read %s ok \n",inpath.c_str());
        }
        string line;
        getline(fin,line);
        vector<char32_t > unicodes;
        vector<char> bytes;

        utf8lineToUnicoides(line,&unicodes);
        getline(fin, line);
        Tool* tool=new Tool();
        tool->utf8lineToUnicoides(line, &unicodes);
        string line2, line3;
        line2=tool->UnicodesToUtf8line(unicodes);
        printf("%s \n%s \n",line.c_str(),line2.c_str());

        for(char32_t u:unicodes){
            string s=to_utf8(u);
            int langid=langId(u);
            bool ishan=isHan(langid);
            int zoneid=zoneId(langid,u);
            printf(" %d \t %s \t %d \t %d \t %d \n",u,s.c_str(),langid,ishan,zoneid);
        }
        delete tool;
        clock_t  t1=clock();
        printf(" 耗时总计 %f ",(t1-t0)/1000.0);
        return 0;
    }

    int zoneId(int langId, char u) {
        if (langId == 0)
            return 0;
        for (int i = 0; i <= 9; i++) {
            if (ilangs[i] == langId) {
                if (i <= 6)
                    return 1;
                else
                    return 4;
            }
        }
        if (isHan(langId)) {
            if (han2idx.find(u)!=han2idx.end())
                return 2;
            else
                return 3;
        }
        //私人区域 149 198 299
        switch (langId) {
            case 49:
            case 198:
            case 299:
                return 9;
        }
        if (langId == 300)  //陌生字
            return 7;

        if (alphabetSize[langId] <= 256)
            return 5;

        return 6;
        // 7,8,9
    }

    bool isHan(int langId) {
        for (int h : hans) {
            if (h == langId)
                return true;
        }
        return false;
    }

    int langId(int unicode){
        for (int i = 0; i < heads.size(); i++) {
            if (unicode >= heads[i] && unicode <= tails[i])
                return i;
        } //oov =300;
        return -1;   //for error
    }
    int utf8lineToUnicoides(string line,vector<char32_t>* unicodes){
        int n=line.length();
        for(int i=0;i<line.length();i++){
            unsigned char c=line[i];
            if(c<0x80) //0xxx xxxx
                unicodes->push_back(line[i]);
            else if(c>=0xc0){ //110x xxxx
                int unicode=to_unicode(&line[i]);
                unicodes->push_back(unicode);
            }
        }
        return 0;
    }

    string UnicodesToUtf8line(vector<char32_t> unicodes){
        string line;
        for(char32_t u:unicodes){
            line+=to_utf8(u);
        }
        return line;
    }

    int testHotHan () {
//    infile.seekg(0,infile.end);
//    unsigned __int64  length =infile.tellg();
//    infile.seekg(0,infile.beg);
//    char model[length];
//    infile.read(model,length);
//    printf("\n--- load %s ok, length %I64u \n",path.c_str(),length);
//
        string  hotHanPath = "../data/zhwiki.txt.countHan";
        hotHan(hotHanPath, nullptr);
        return 0;
    }
    int hotHan(string inpath,string hanstr){
        if(inpath.size()==0){
           vector<char32_t> hans;
           utf8lineToUnicoides(hanstr,&hans);
           for(int i=0;i<12000;i++){
               char32_t c=hans[i];
               han2idx[c]=i;
               idx2han[i]=c;
           }
            return 0;
        }

        FILE * infile=fopen(inpath.c_str(),"r");
        if(infile==NULL){
            printf(" read %s fail \n",inpath.c_str());
            perror(" error! %s  \n");
        }else{
            printf("read %s ok \n",inpath.c_str());
        }

        ifstream fin;
        fin.open(inpath);
        char32_t han;
        unsigned int idx;
        string line;

        while(!feof(infile)){
//        fread(&record,sizeof(record),1,infile);
//            fscanf(infile,"%d %c %d",record.idx,record.h,record.count);
            getline(fin,line);
            int space=0;
            int pos=0;
            for(int i=0;i<line.size();i++){
                if(line[i]==' '){
                    space++;
                    switch(space){
                        case 1:
                            idx=stoi(line.substr(0,i));
                            pos=i+1;
                            break;
                        case 2:
                            string s=line.substr(pos,6);
//                        printf("%s",s.c_str());
                            han=to_unicode(s);
                    }
                    if(space==2)
                        break;
                }
            }
            han2idx[han]=idx;
            idx2han[idx]=han;
//            printf(" %u %u  %c %s  \n",han2idx[han],idx, idx2han[idx],to_utf8(idx2han[idx]).c_str() ); // 3 3  t 年
            if(han2idx.size()>=12000){
                printf("hotHan over 12000!  \n");
//            int c=0;
//            for(unordered_map<char32_t , unsigned  int>::const_iterator it=han2idx.begin();it!=han2idx.end();it++){
//                char32_t h=it->first;
//                unsigned  int t=it->second;
//                printf(" --%d ,%s , %u , %u , %c .\n",c,   to_utf8(h),t,idx2han[h],idx2han[t]);
//                c++;
//            }
                break;
            }

        }

        printf("han map ok! \n");
        return 0;
    }
    uint32_t to_unicode(std::string const &utf8)
    {
        uint32_t unicode = 0;
        uint8_t first_byte = (uint8_t)utf8[0];
        uint8_t len =
                (first_byte >> 7) == 0 ? 1 :
                (first_byte & 0xf0) == 0xf0 ? 4 :
                (first_byte & 0xe0) == 0xe0 ? 3 :
                (first_byte & 0xc0) == 0xc0 ? 2 : 0
        ;
        unicode += (uint8_t)(first_byte << len) >> len;
        for(auto i = 1; i < len; ++i) {
            unicode <<= 6;
            unicode += ((uint8_t)utf8[i]) & 0x3F;
        }
//    std::cout <<"("<< (uint32_t)len << ")";
        return unicode;
    }
    std::string to_utf8(uint32_t unicode)    {
        uint8_t len = 0;
        uint8_t mask = 0xF0; // 1111 0000
        std::string utf8;
        len =
                unicode < 0x10000 ?
                unicode < 0x800 ?
                unicode < 0x80 ?
                1 : 2 : 3 : 4
                ;
        mask >>= 8 - len;
        mask <<= 8 - len;
        if (len == 1)
            mask = 0;
        for(auto i=1; i<len;++i) {
            utf8.insert(0, 1, (unicode & 0x3f) | 0x80);
            unicode >>= 6;
        }
        utf8.insert(0, 1, (uint8_t)(mask | unicode));
        return utf8;
    }

    int testconvert(void)    {
        uint32_t code[] = { 0, 0x7f, 0x80, 0x7ff, 0x0800, 0xffff, 0x10000, 0x1fffff };
        for (auto c : code) {
            std::string utf8 = to_utf8(c);
            std::cout << std::hex << c << " : ";
            for(auto u : utf8) {
                std::cout << std::setw(2) << std::hex << (0x0ff & (uint32_t)u);
            }
            std::cout << "(" << utf8.size() << ")" << " : ";
            std::cout << std::hex << to_unicode(utf8) << std::endl;
        }
        return 0;
    }

};

//int myTool(){
//    Tool tool;
//    tool.main();
////    tool.testconvert();
//    return 0;
//}